import sqlite3
import os

DB_PATH = os.path.join(os.path.dirname(os.path.abspath(__file__)), 'recipes.db')


def recreate_database():
    if os.path.exists(DB_PATH):
        os.remove(DB_PATH)

    conn = sqlite3.connect(DB_PATH)
    conn.execute('PRAGMA foreign_keys = ON')
    return conn


def create_tables(conn):
    cursor = conn.cursor()
    cursor.execute('''
        CREATE TABLE dishes (
            id INTEGER PRIMARY KEY AUTOINCREMENT,
            name TEXT NOT NULL UNIQUE,
            category TEXT NOT NULL,
            image TEXT
        )
    ''')
    cursor.execute('''
        CREATE TABLE recipes (
            id INTEGER PRIMARY KEY AUTOINCREMENT,
            dish_id INTEGER NOT NULL,
            cooking_method TEXT NOT NULL,
            ingredients TEXT NOT NULL,
            recipe TEXT NOT NULL,
            time TEXT,
            calories INTEGER,
            price INTEGER,
            image TEXT,
            FOREIGN KEY (dish_id) REFERENCES dishes(id) ON DELETE CASCADE
        )
    ''')




def insert_dishes(conn, dishes):
    cursor = conn.cursor()
    cursor.executemany(
        'INSERT INTO dishes (name, category, image) VALUES (?, ?, ?)',
        dishes
    )


def insert_recipes(conn, recipes):
    cursor = conn.cursor()

    for r in recipes:
        dish_name, cooking_method, ingredients, recipe, time, calories, price, image = r
        cursor.execute('SELECT id FROM dishes WHERE name = ?', (dish_name,))
        row = cursor.fetchone()
        if not row:
            print(f"  ⚠ Блюдо '{dish_name}' не найдено — пропускаю рецепт '{cooking_method}'")
            continue
        dish_id = row[0]

        cursor.execute('''
            INSERT INTO recipes
            (dish_id, cooking_method, ingredients, recipe, time, calories, price, image)
            VALUES (?, ?, ?, ?, ?, ?, ?, ?)
        ''', (dish_id, cooking_method, ingredients, recipe, time, calories, price, image))




def main():
    conn = recreate_database()
    create_tables(conn)
    dishes = [
        ('Сырники', 'Завтрак', None),
        ('Панкейки на кефире', 'Завтрак', None),
        ('Тост с авокадо и яйцом',"Завтрак",None),
        ('Горячие бутерброды','Завтрак',None),
        ('Омлет', 'Завтрак', None),
        ('Яичница с томатами', 'Завтрак', None),
        ('Лаваш с яйцом и овощами', 'Завтрак', None),
        ('Овсяноблин', 'Завтрак', None),
        ('Овсяная каша на молоке','Завтрак',None),
        ('Гречневая каша на молоке', 'Завтрак', None),
        ('Рисовая каша на молоке', 'Завтрак', None),
        ('Пшенная каша на молоке', 'Завтрак', None),
        ('Горячие бутерброды с сыром и яйцами', 'Завтрак', None),
        ('Творожная запеканка с манкой', 'Завтрак', None),
        ('Борщ', 'Суп', None),
        ('Рассольник', 'Суп', None),
        ('Гороховый суп', 'Суп', None),
        ('Суп с фрикадельками', 'Суп', None),
        ('Грибной суп', 'Суп', None),
        ('Рыбный суп из консерв', 'Суп', None),
        ('Грибной крем-суп', 'Суп', None),
        ('Овощной суп', 'Суп', None),
        ('Щи', 'Суп', None),
        ('Индейка на пару', 'Ужин', None),
        ('Овощное рагу с кабачками', 'Ужин', None),
        ('Картошка фри', 'Ужин', None),
        ('Курица с макаронами', 'Ужин', None),
        ('Гречка с молоком', 'Ужин', None),
        ('Макароны с сыром', 'Ужин', None),
        ('Паста карбонара', 'Ужин', None),
        ('Жареные кабачки с мясом', 'Ужин', None),
        ('Фунчоза', 'Ужин', None),
        ('Пюре с куриной котлеткой', 'Ужин', None),
        ('Шарлотка с яблоками', 'Десерт', None),
        ('Банановый пирог', 'Десерт', None),
        ('Сырники (десерт)', 'Десерт', None),
        ('Грушевый рулет', 'Десерт', None),
        ('Шоколадные кексы', 'Десерт', None),
        ('Оладьи яблочные', 'Десерт', None),
        ('Вишнёвый пирог', 'Десерт', None),
        ('Печенье брауни', 'Десерт', None),
    ]

    recipes = [
        # Сырники
        ('Сырники', 'На плите',
         'Творог (5–9% жирности) — 400 г\nЯйцо — 1 шт.\nМука пшеничная — 4 ст. л. (часть в тесто, часть для обваливания)\nСахар — 2 ст. л.\nСоль — ½ ч. л.\nСливочное масло — немного для жарки',
         '1. В миске разомните творог вилкой. Если он крупинчатый, протрите через сито. Добавьте яйцо, сахар и соль.\n'
         '2. Постепенно вводите муку, вымешивая до консистенции густого, чуть липкого теста. Если масса слишком влажная, подсыпьте ещё немного муки, но не переусердствуйте — иначе сырники получатся «резиновыми».\n'
         '3. Влажными руками сформируйте шарики, слегка приплюсните и обваляйте в муке. Можно придать форму «шайбы», накрыв заготовку стаканом.\n'
         '4. Хорошо разогрейте сковороду с маслом. Выложите сырники и жарьте на среднем огне. Сначала до румяной корочки с одной стороны (около 2–3 минут), затем переверните и дожарьте с другой. В конце можно накрыть крышкой и потомить 3–5 минут.\n'
         '5. Готовые сырники выложите на бумажные полотенца, чтобы убрать лишний жир.',
         '15', 207, 193,
         'https://s3.coolclever.tech/upload/cool_admin/recipe/retsept-syrniki-anons-67068005ade12021044455.jpg'),
        ('Сырники', 'В аэрогриле',
         'Творог (8%) — 600 г\nМанная крупа — 150 г\nСахар — 100 г\nВанильный сахар — 10 г\nРазрыхлитель теста — 2 ч. л.\nЯйцо куриное — 2 шт.\nСоль — на кончике ножа\nМука пшеничная — 150 г (для обвалки)',
         '1. Подготовьте творог. Он должен быть сухим — лучше брать развесной. Если творог влажный, откиньте на марлю и поставьте под пресс на 2–4 часа.\n'
         '2. Смешайте основу. В миску выложите творог, вбейте яйца и перемешайте вилкой (или миксером) до однородности.\n'
         '3. Добавьте сухие ингредиенты. Всыпьте соль, сахар, ванильный сахар, разрыхлитель — тщательно перемешайте. В последнюю очередь добавьте манку, перемешайте, накройте плёнкой и оставьте на 30 минут: манка должна набухнуть.\n'
         '4. Сформуйте сырники. Влажными руками слепите небольшие сырники весом 30–40 г, обваляйте каждый в муке. Оставляйте между заготовками расстояние.\n'
         '5. Запекайте. Чашу аэрогриля выстелите пергаментом, масло не добавляйте. Выложите сырники и готовьте при 180 °C 25 минут. Через 15 минут переверните.',
         '20', 224, 300,
         'https://rutxt.ru/files/19815/final/efecec16b5.jpg'),
        ('Сырники', 'В духовке',
         'Творог (5–9%) — 360 г\nЯичный желток — 1 шт.\nМанка — 30 г\nКукурузный крахмал — 20 г\nСахар — 30 г\nВанилин — по вкусу',
         '1. В миске соедините творог, желток, манку, крахмал, сахар и ванилин. Тщательно перемешайте вилкой до однородности. Дайте массе немного постоять.\n'
         '2. Влажными руками сформируйте сырники. Чтобы они получились ровными, придайте форму с помощью стакана или кулинарного кольца.\n'
         '3. Выложите сырники в корзину аэрогриля, оставляя между ними небольшое расстояние.\n'
         '4. Готовьте сначала при 130 °C около 10 минут, затем увеличьте температуру до 160 °C и запекайте ещё примерно 10 минут. В середине времени переверните.',
         '25', 175, 169,
         'https://menunedeli.ru/wp-content/uploads/2026/07/Sirniki-klassicheskie-iz-tvoroga-v-dukhovke-11-1000x667.jpg'),
        # Панкейки
        ('Панкейки на кефире', 'На плите',
         'Кефир (жирностью от 2,5%) — 250 мл\nМука пшеничная — 180–200 г\nЯйцо — 1 шт.\nСахар — 2–3 ст. л.\nСода — 0,5 ч. л.\nРазрыхлитель — 1 ч. л.\nСоль — щепотка\nРастительное масло — 2 ст. л.',
         '1. Кефир слегка подогрейте (до комнатной температуры), но не кипятите. Добавьте в него соду — пусть масса немного вспенится.\n'
         '2. В отдельной миске взбейте яйцо с сахаром и солью. Соедините с кефиром и перемешайте.\n'
         '3. В отдельной посуде смешайте муку, разрыхлитель и постепенно вводите эту смесь в жидкую основу, замешивая тесто. Оно должно получиться густым, как густая сметана.\n'
         '4. Влейте растительное масло и ещё раз хорошо перемешайте.\n'
         '5. Хорошо разогрейте сковороду. Выкладывайте тесто ложкой (примерно по 1–1,5 ст. л.), формируя круглые лепёшки.\n'
         '6. Жарьте на среднем огне. Как только на поверхности появятся и начнут лопаться пузырьки — пора переворачивать. Затем жарьте вторую сторону до румяной корочки.',
         '15', 150, 60,
         'https://cdn.lifehacker.ru/wp-content/uploads/2020/06/Depositphotos_100947814_xl-2015-1_1591179837-1280x640.jpg'),
        ('Тост с авокадо и яйцом', 'На плите',
         'Хлеб (цельнозерновой, ржаной или другой на вкус) — 1 ломтик\nАвокадо — ½ спелого плода\nЯйцо — 1 шт.\nЛимонный сок — 1 ч. л.\nСоль, перец — по вкусу\nОливковое масло — по желанию\nДля подачи: зелень, кунжут, чили, помидоры черри — по желанию',
         '1. Подсушите хлеб. Можно обжарить ломтик на сухой сковороде до золотистой корочки или использовать тостер.\n'
         '2. Очистите авокадо, разомните вилкой в пюре. Добавьте лимонный сок, щепотку соли и перца. Можно капнуть немного оливкового масла.\n'
         '3. Приготовьте яйцо. Сделайте глазунью (жарьте 2–3 минуты, чтобы желток остался жидким), скрэмбл (взбейте яйцо с солью и жарьте на слабом огне, помешивая) или пашот (аккуратно влейте в кипящую подкисленную воду и варите около 3 минут).\n'
         '4. Соберите тост: на поджаренный хлеб выложите пюре из авокадо, сверху — яйцо. Приправьте по вкусу и украсьте зеленью, кунжутом или другими добавками. Подавайте сразу.',
         '15', 220, 100,
         'https://www.chefmarket.ru/blog/wp-content/uploads/2023/05/buterbrody-s-avokado-2000x1200.jpg'),
        ('Панкейки на кефире', 'В аэрогриле',
         'Кефир — 250 мл\nМука — 180–200 г\nЯйцо — 1 шт.\nСахар — 2–3 ст. л.\nСода — 0,5 ч. л.\nРазрыхлитель — 1 ч. л.\nСоль — щепотка\nРастительное масло — 2 ст. л.',
         '1. Замесите тесто так же, как и для сковороды: кефир с содой, затем яйцо с сахаром и солью, потом мука с разрыхлителем, в конце — растительное масло. Дайте тесту постоять 10–15 минут.\n'
         '2. В чашу аэрогриля установите решётку. Слегка смажьте её растительным маслом.\n'
         '3. Ложкой выложите порции теста на решётку, оставляя между ними расстояние.\n'
         '4. Выпекайте при температуре около 180 °C примерно 8–10 минут. В середине процесса переверните панкейки.',
         '20', 130, 60,
         'https://img.iamcook.ru/2026/upl/recipes/cat/u5861-7f6018861b97791a54e22faee3050297.jpg'),
        ('Тост с авокадо и яйцом', 'На плите',
         'Хлеб (цельнозерновой, ржаной или другой на вкус) — 1 ломтик\nАвокадо — ½ спелого плода\nЯйцо — 1 шт.\nЛимонный сок — 1 ч. л.\nСоль, перец — по вкусу\nОливковое масло — по желанию\nДля подачи: зелень, кунжут, чили, помидоры черри — по желанию',
         '1. Подсушите хлеб. Можно обжарить ломтик на сухой сковороде до золотистой корочки или использовать тостер.\n'
         '2. Очистите авокадо, разомните вилкой в пюре. Добавьте лимонный сок, щепотку соли и перца. Можно капнуть немного оливкового масла.\n'
         '3. Приготовьте яйцо. Сделайте глазунью (жарьте 2–3 минуты, чтобы желток остался жидким), скрэмбл (взбейте яйцо с солью и жарьте на слабом огне, помешивая) или пашот (аккуратно влейте в кипящую подкисленную воду и варите около 3 минут).\n'
         '4. Соберите тост: на поджаренный хлеб выложите пюре из авокадо, сверху — яйцо. Приправьте по вкусу и украсьте зеленью, кунжутом или другими добавками. Подавайте сразу.',
         '15', 220, 100,
         'https://www.chefmarket.ru/blog/wp-content/uploads/2023/05/buterbrody-s-avokado-2000x1200.jpg'),
        ('Тост с авокадо и яйцом', 'В аэрогриле',
         'Хлеб для тостов (белый или цельнозерновой) — 2 ломтика\nЯйца — 2 шт.\nАвокадо — 1 шт.\nЛимонный сок — 1 ч. л.\nСоль, перец — по вкусу\nХлопья чили — щепотка (по желанию)',
         '1. Разогрейте аэрогриль в режиме «Выпечка» (Bake) до 180 °C.\n'
         '2. Очистите авокадо, разомните вилкой, сбрызните лимонным соком, посолите и поперчите.\n'
         '3. Намажьте авокадо толстым слоем на тосты.\n'
         '4. Сделайте небольшое углубление в центре каждого тоста и аккуратно вбейте в него яйцо. Слегка посолите, при желании добавьте щепотку хлопьев чили.\n'
         '5. Поместите тосты в корзину аэрогриля и запекайте 8–10 минут. Ориентируйтесь на желаемую степень готовности желтка.',
         '10', 310, 150,
         'https://s3.twcstorage.ru/58f2c883-afd78aa4-0a05-45f8-9bd9-216f4c7aaa11/vilka/daily/zapechyonnye-tosty-s-yaytsom-i-avokado-2026-06-23-480d/0.jpg'),
        ('Горячие бутерброды', 'На плите',
         '4 ломтика тостового хлеба\n2 яйца\n100 г ветчины\n100 г твёрдого сыра (который хорошо плавится)\nРастительное масло для жарки\nСоль, перец — по вкусу',
         '1. Ветчину нарежьте ломтиками, сыр натрите на тёрке. Яйца взбейте венчиком с солью и перцем.\n'
         '2. Возьмите большую сковороду, чтобы в неё свободно поместились два ломтика хлеба. Налейте немного масла и нагрейте. Вылейте половину взбитых яиц, а сверху сразу положите два ломтика хлеба. Жарьте около 40 секунд на среднем огне.\n'
         '3. Переверните хлеб вместе с яичной массой. На один ломтик выложите половину ветчины и половину сыра. Аккуратно сложите бутерброд так, чтобы второй ломтик (с яйцом) оказался сверху.\n'
         '4. Жарьте ещё около минуты, затем переверните и дожарьте с другой стороны. Повторите то же самое со второй порцией ингредиентов. Подавайте сразу, посыпав зеленью.',
         '15', 240, 150,
         'https://www.russianfood.com/dycontent/images_upl/610/big_609900.jpg'),
        ('Горячие бутерброды', 'В аэрогриле',
         '4 ломтика хлеба (батон, чиабатта или тостовый)\n120 г колбасы (варёной, копчёной или сырокопчёной)\n1 помидор\n50 г твёрдого сыра\n2–3 ст. л. майонеза (по желанию)',
         '1. Колбасу нарежьте мелкими кубиками, помидор — тонкими кружочками, сыр натрите на тёрке. Если используете майонез, смешайте его с колбасой и сыром.\n'
         '2. Выложите начинку на ломтики хлеба, сверху добавьте кружок помидора.\n'
         '3. Разогрейте аэрогриль до 180–200 °C. Положите бутерброды в чашу. Запекайте 5–7 минут до расплавления сыра и появления румяной корочки.',
         '15', 230, 150,
         'https://rutxt.ru/files/24109/final/026a7a129e.jpg'),
        ('Горячие бутерброды', 'В духовке',
         '6 ломтиков батона\n100 г колбасы\n1 помидор\n100 г твёрдого сыра\n1 ст. л. майонеза\n1 зубчик чеснока\nСоль, смесь перцев — по вкусу',
         '1. Соедините майонез с измельчённым чесноком, слегка посолите и поперчите.\n'
         '2. Нарежьте колбасу, помидор — тонкими кружочками, сыр натрите на крупной тёрке.\n'
         '3. Выложите ломтики батона на противень. Смажьте тонким слоем чесночно-майонезной смеси, затем разложите колбасу, сверху — кружочки помидора. Посыпьте тёртым сыром.\n'
         '4. Запекайте в духовке при 180 °C, пока сыр не расплавится и не начнёт слегка подрумяниваться.',
         '35', 170, 100,
         'https://img.iamcook.ru/2018/upl/recipes/cat/u-c39b63926b087e4804b608c6ec337bff.JPG'),
        ('Омлет', 'На плите',
         '3 яйца\n90 мл молока (примерно 30 мл на яйцо)\nЩепотка соли\nЧёрный молотый перец — по вкусу\n1–2 ст. л. растительного или сливочного масла',
         '1. Разбейте яйца в миску. Совет: если достать их из холодильника заранее, чтобы они были комнатной температуры, омлет получится пышнее.\n'
         '2. Влейте молоко, добавьте соль и перец. Взбейте венчиком или вилкой до однородности. Не взбивайте слишком активно — цель лишь соединить белки с желтками.\n'
         '3. Разогрейте сковороду на среднем огне, смажьте маслом. Аккуратно влейте яичную массу.\n'
         '4. Убавьте огонь до минимального, накройте крышкой и готовьте 7–10 минут, пока сверху масса не схватится. Не поднимайте крышку раньше времени — омлет может опасть.\n'
         '5. Переложите на тарелку. Можно посыпать свежей зеленью перед подачей.',
         '20', 240, 50,
         'https://img.povar.ru/main-micro/a8/8b/28/4b/omlet_klassicheskii_s_molokom-793982.JPG'),
        ('Омлет', 'В аэрогриле',
         '4 яйца\n200 мл молока\nЩепотка соли\nЧёрный молотый перец\n5 г сливочного масла (для смазывания формы)',
         '1. Яйца вымойте, разбейте в миску и слегка взбейте вилкой или венчиком до однородности.\n'
         '2. Влейте молоко, посолите, поперчите. Снова перемешайте. Если добавляете начинку (сыр, овощи), вмешайте её сейчас.\n'
         '3. Подготовьте форму для выпечки. Смажьте её сливочным маслом. Если у вашего аэрогриля верхний вентилятор, выбирайте форму так, чтобы смесь не доходила до краёв примерно на 2 см.\n'
         '4. Влейте смесь в форму и поставьте в аэрогриль.\n'
         '5. Выпекайте при температуре около 180 °C примерно 15–20 минут. Ориентируйтесь на свою модель.\n'
         '6. Как проверить готовность: через 15 минут слегка потрясите форму. Если омлет колышется — ему нужно ещё время. Края должны отходить от стенок, а поверхность — стать матовой и упругой.\n'
         '7. После сигнала выключите аэрогриль и оставьте омлет с приоткрытой крышкой на 2–3 минуты.',
         '20', 260, 100,
         'https://images.gastronom.ru/gJ1F69Bw4VU7fnmVW1ktpYt0zvPxkIvRIgg14zidt3s/pr:recipe-cover-image/g:ce/rs:auto:0:0:0/L2Ntcy9hbGwtaW1hZ2VzL2EzNjVkODFiLTVlNGMtNDMyNC1iYTJkLTllNDY0ZTA2MWVmNy5qcGc.webp'),
        ('Яичница с томатами', 'На плите',
         '3 яйца\n90 мл молока\nЩепотка соли\nЧёрный молотый перец — по вкусу\n1–2 ст. л. растительного или сливочного масла',
         '1. Разбейте яйца в миску. Совет: если достать их из холодильника заранее, чтобы они были комнатной температуры, яичница получится пышнее.\n'
         '2. Влейте молоко, добавьте соль и перец. Взбейте венчиком или вилкой до однородности. Не взбивайте слишком активно.\n'
         '3. Разогрейте сковороду на среднем огне, смажьте маслом. Аккуратно влейте яичную массу.\n'
         '4. Убавьте огонь до минимального, накройте крышкой и готовьте 7–10 минут, пока сверху масса не схватится.\n'
         '5. Переложите на тарелку. Можно посыпать свежей зеленью перед подачей.',
         '15', 450, 100,
         'https://e3.edimdoma.ru/data/recipes/0003/3847/33847-ed4_big_wide.jpg?1759133542'),
        ('Яичница с томатами', 'В аэрогриле',
         '4 яйца\n200 мл молока\nЩепотка соли\nЧёрный молотый перец\n5 г сливочного масла (для смазывания формы)',
         '1. Яйца вымойте, разбейте в миску и слегка взбейте вилкой или венчиком до однородности.\n'
         '2. Влейте молоко, посолите, поперчите. Снова перемешайте.\n'
         '3. Подготовьте форму для выпечки. Смажьте её сливочным маслом. Смесь не должна доходить до краёв примерно на 2 см.\n'
         '4. Влейте смесь в форму и поставьте в аэрогриль.\n'
         '5. Выпекайте при температуре около 180 °C примерно 15–20 минут.\n'
         '6. Как проверить готовность: через 15 минут слегка потрясите форму. Если колышется — нужно ещё время.\n'
         '7. После сигнала оставьте на 2–3 минуты с приоткрытой крышкой.',
         '25', 430, 100,
         'https://img.iamcook.ru/2024/upl/recipes/cat/u-fa2b6df623f3d58f1ed9ea7920beaebe.JPG'),
        ('Лаваш с яйцом и овощами', 'На плите',
         '2 круглых листа лаваша (или один большой, вырезанный под диаметр сковороды)\n3 яйца\n100 мл молока (можно не добавлять, если любите более плотную текстуру)\n1 помидор, нарезанный кубиками\n1 сладкий перец, нарезанный кубиками (можно заменить на кабачок)\n100 г полутвёрдого сыра\n1 ст. л. растительного масла\nСоль, чёрный перец, зелень (петрушка, укроп) для подачи',
         '1. Сверните лаваш неплотной трубочкой и нарежьте поперёк полосками шириной 8–10 мм. Разберите полоски руками, чтобы они равномерно распределились в сковороде.\n'
         '2. Если помидор очень сочный, слейте жидкость с доски — лишняя влага помешает яичной смеси схватиться.\n'
         '3. Взбейте яйца с молоком, солью и перцем до однородности (без пышной пены).\n'
         '4. Смажьте сковороду маслом. Разложите лаваш ровным рыхлым слоем и залейте яичной смесью. Сверху распределите овощи и тёртый сыр.\n'
         '5. Поставьте сковороду на слабый огонь и накройте крышкой. Готовьте 10–12 минут. Края должны подрумяниться, сыр — расплавиться, а центр яичной массы — стать упругим.\n'
         '6. Снимите с огня, оставьте под крышкой на 2 минуты, затем посыпьте зеленью.',
         '15', 165, 160,
         'https://avatars.dzeninfra.ru/get-zen_doc/271828/pub_699dd6f384be6c70fda2087e_699ddb6284be6c70fda87012/scale_1200'),
        ('Лаваш с яйцом и овощами', 'В аэрогриле',
         '1 лист тонкого лаваша\n2 яйца\n1 помидор (или несколько черри)\nГорсть свежего шпината (или рукколы, или другой зелени)\n50–80 г моцареллы или сулугуни\nСоль, чёрный перец, щепотка сухого чеснока (по желанию)\nЧуть-чуть оливкового масла',
         '1. Разрежьте лаваш на две части. Сформируйте из каждой «лодочку» или конвертик — загните и подогните края, чтобы начинка не вытекла. Можно выложить заготовки в жаропрочные формы или прямо в корзину аэрогриля.\n'
         '2. Слегка смажьте лаваш маслом.\n'
         '3. Выложите шпинат, сверху — нарезанные томаты, затем кусочки сыра.\n'
         '4. Аккуратно вбейте по яйцу в каждую «лодочку». Посолите, поперчите, добавьте чеснок.\n'
         '5. Запекайте при 180 °C примерно 8–10 минут. Если хотите более плотный желток — добавьте ещё 1–2 минуты.',
         '15', 200, 200,
         'https://www.tvcook.ru/content/uploads/zavtrak-iz-lavasha-s-ovoshami-hero.png'),
        ('Овсяноблин', 'На плите',
         'Овсяные хлопья — 2 ст. л. (если хлопья крупные, пробейте их блендером в крошку)\nЯйцо — 1 шт.\nВода — 50 мл (можно заменить на молоко)\nСоль — по вкусу\nРастительное масло — 1 ст. л.',
         '1. Если используете крупные хлопья, измельчите их. Затем положите хлопья в миску, залейте тёплой водой и дайте постоять около 5 минут, чтобы они немного набухли.\n'
         '2. Вбейте в овсяную массу яйцо и хорошо перемешайте. Посолите.\n'
         '3. Разогрейте сковороду на среднем огне. Если сковорода обычная, слегка смажьте её растительным маслом.\n'
         '4. Вылейте тесто и равномерно распределите силиконовой лопаточкой.\n'
         '5. Накройте сковороду крышкой и жарьте примерно 3 минуты с одной стороны, пока поверхность не схватится.\n'
         '6. Можно аккуратно перевернуть лопаткой и подержать ещё минуту, чтобы подрумянить.\n'
         '7. Переложите блин на тарелку. Можно сложить его пополам или свернуть рулетиком с начинкой.',
         '15', 450, 17,
         'https://kulinarenok.ru/storage/recipes/44323/image/11-5.jpg'),
        ('Овсяноблин', 'В аэрогриле',
         'Овсяные хлопья (те, что нужно варить, не быстрого приготовления) — 3 ст. л.\nЯйцо — 1 шт.\nМолоко — 50 мл\nСоль — щепотка',
         '1. В миске соедините яйцо и молоко. Не взбивайте интенсивно, просто перемешайте.\n'
         '2. Добавьте овсяные хлопья и соль, ещё раз перемешайте.\n'
         '3. В чашу аэрогриля выложите лист пергамента (можно сделать небольшие бортики). Если есть силиконовая форма — используйте её.\n'
         '4. Вылейте тесто на пергамент или в форму.\n'
         '5. Установите температуру 180 °C и время 10 минут.\n'
         '6. По истечении времени откройте аэрогриль и проверьте готовность. Если на поверхности видны следы сырого яйца, допеките ещё пару минут.\n'
         '7. Готовый блин аккуратно достаньте, дайте немного остыть, затем снимите с пергамента.',
         '15', 200, 13,
         'https://img.iamcook.ru/2025/upl/recipes/cat/u-9aa0eccaca0db07a3c8ce16252369382.jpg'),
        ('Овсяная каша на молоке', 'На плите',
         'Овсяные хлопья — 1 стакан (лучше взять «Геркулес» или средние)\nМолоко — 1 стакан\nВода — 1,5 стакана\nСоль — щепотка\nСахар — 1 ч. л. (или по вкусу)\nСливочное масло — 1 ст. л.',
         '1. В кастрюлю с толстым дном влейте воду и доведите до кипения.\n'
         '2. Всыпьте хлопья, перемешайте, чтобы не прилипли ко дну, и варите на небольшом огне 5–7 минут, помешивая.\n'
         '3. Когда хлопья начнут разбухать, влейте молоко, добавьте соль и сахар.\n'
         '4. Продолжайте варить на минимальном огне ещё около 10 минут, периодически помешивая.\n'
         '5. Когда каша загустеет, выключите огонь, накройте крышкой и дайте настояться 5 минут.\n'
         '6. Перед подачей добавьте сливочное масло и перемешайте.',
         '25', 190, 70,
         'https://images.gastronom.ru/HWCQZ-tEnqpY__O5ozIVY0Z0zrKf3I_nxTdifYDiabo/pr:recipe-cover-image/g:ce/rs:auto:0:0:0/L2Ntcy9hbGwtaW1hZ2VzL2RiZDMyNTNhLTI4NWEtNDM4OS05NDFmLThlNTVhZWM3YWNlOC5qcGc.webp'),
        ('Овсяная каша на молоке', 'В мультиварке',
         'Овсяные хлопья — 1 мультистакан\nМолоко — 4 мультистакана\nСоль — щепотка\nСахар — 1 ст. л. (или по вкусу)\nСливочное масло — 20 г (в кашу) + немного для смазывания краёв чаши',
         '1. В чашу мультиварки всыпьте хлопья, добавьте соль и сахар.\n'
         '2. Влейте молоко и перемешайте.\n'
         '3. Чтобы молоко точно не убежало, смажьте верхние края чаши сливочным маслом. Можно также установить сверху поддон для пароварки.\n'
         '4. Закройте крышку и выберите режим «Молочная каша». Время приготовления — около 20 минут, но лучше свериться с инструкцией к вашей мультиварке.\n'
         '5. По сигналу откройте крышку, добавьте сливочное масло и тщательно перемешайте.',
         '25', 130, 100,
         'https://rutxt.ru/files/16409/899babbb21.jpg'),
        ('Гречневая каша на молоке', 'На плите',
         'Гречневая крупа — 1 стакан\nВода — 2 стакана\nМолоко — 2–3 стакана\nСливочное масло — 2 ст. л.\nСахар — 2 ст. л. (или по вкусу)\nСоль — ½ ч. л.',
         '1. Переберите гречку, удаляя мусор и испорченные зёрна, затем тщательно промойте в холодной воде.\n'
         '2. Переложите крупу в толстостенную кастрюлю, залейте холодной водой, накройте крышкой и поставьте на сильный огонь. После закипания убавьте огонь до минимального и варите, пока вода почти полностью не испарится (примерно 10–15 минут).\n'
         '3. Не варите гречку сразу в молоке — так она может плохо развариться. Добавьте к почти готовой гречке горячее молоко, перемешайте и томите под неплотно закрытой крышкой на самом маленьком огне около 20 минут.\n'
         '4. Когда каша хорошо разварится, добавьте соль, сахар и сливочное масло. Перемешайте и дайте побулькать ещё около 5 минут.\n'
         '5. Выключите огонь, накройте кастрюлю крышкой и дайте каше отдохнуть 10 минут. Перед подачей ещё раз перемешайте.',
         '20', 114, 100,
         'https://finecooking.ru/images/recipe/grechnevaya-kasha-na-moloke-v-kastryule/photo/960w.webp'),
        ('Гречневая каша на молоке', 'В мультиварке',
         'Гречневая крупа — 1 стакан\nВода — 2 стакана\nМолоко — 1–1,5 стакана\nСливочное масло — 20–30 г\nСоль — щепотка\nСахар — по вкусу',
         '1. Подготовьте крупу: переберите и промойте.\n'
         '2. Выложите гречку в чашу мультиварки, добавьте соль и сахар. Влейте воду.\n'
         '3. Выберите режим «Каша» или «Крупа» и установите время примерно 20 минут. Когда прозвучит сигнал, гречка будет почти готова.\n'
         '4. Влейте тёплое или горячее молоко. Закройте крышку и дайте каше потомиться ещё несколько минут.\n'
         '5. Добавьте сливочное масло, перемешайте. Можно оставить кашу ещё на пару минут в режиме подогрева.',
         '20', 140, 70,
         'https://img.iamcook.ru/2017/upl/recipes/cat/u-066eb49c1da5ca82af14c1d896be55f4.jpg'),
        ('Рисовая каша на молоке', 'На плите',
         'Рис — 100 г (около ¾ стакана)\nВода — 200 мл\nМолоко — 400 мл\nСоль — щепотка\nСахар — по вкусу (начните с 1–2 ст. л.)\nСливочное масло — 10–15 г',
         '1. Рис тщательно промойте под проточной водой, пока вода не станет прозрачной.\n'
         '2. Переложите рис в кастрюлю (желательно с толстым дном). Залейте водой и поставьте на средний огонь. Варите, периодически помешивая, примерно 10 минут — до полуготовности.\n'
         '3. Когда вода почти выкипит, влейте молоко. Убавьте огонь до минимума.\n'
         '4. Добавьте соль и сахар. Перемешайте.\n'
         '5. Томите под крышкой 15–20 минут, изредка помешивая.\n'
         '6. Когда рис станет мягким, выключите огонь. Добавьте кусочек сливочного масла, перемешайте.\n'
         '7. Накройте кастрюлю крышкой и дайте каше настояться 5–10 минут.',
         '30', 390, 60,
         'https://kulinarenok.ru/storage/recipes/51335/image/FqnSlEANA96IMwQQezOBEa2L2KyHDg3EfBVnOT78.jpg'),

        ('Рисовая каша на молоке', 'В мультиварке',
         'Рис — 1 стакан (около 150 г)\nМолоко — 2,5 стакана\nВода — 2,5 стакана\nСахар — 2 ст. л. (или по вкусу)\nСоль — ½ ч. л.\nСливочное масло — 20–30 г',
         '1. Рис промойте до прозрачной воды.\n'
         '2. Чашу мультиварки слегка смажьте тонким слоем сливочного масла.\n'
         '3. Выложите в чашу рис, влейте молоко и воду, добавьте соль и сахар. Перемешайте.\n'
         '4. Закройте крышку. Выберите режим «Молочная каша». Если такого нет, подойдут «Каша», «Крупы» или «Рис». Установите время примерно 30–35 минут.\n'
         '5. После звукового сигнала оставьте кашу в режиме «Подогрев» на 5–10 минут.\n'
         '6. Перед подачей добавьте кусочек сливочного масла и перемешайте.',
         '45', 380, 100,
         'https://cdn.lifehacker.ru/wp-content/uploads/2022/11/PHT_2871_1_1738974960_lh_average_step_2.jpg'),
        ('Пшенная каша на молоке', 'На плите',
         'Пшено — 1 стакан\nМолоко — 2 стакана\nВода — 1 стакан\nСахар — 1–2 ст. л. (или по вкусу)\nСоль — щепотка\nСливочное масло — по вкусу',
         '1. Пшено переберите и тщательно промойте под проточной водой, пока вода не станет прозрачной. Затем залейте крупу кипятком и оставьте на 5–10 минут — это поможет убрать возможную горечь. После слейте кипяток.\n'
         '2. Переложите подготовленное пшено в кастрюлю. Добавьте воду и молоко, поставьте на средний огонь.\n'
         '3. Доведите до кипения, затем убавьте огонь. Варите, периодически помешивая, примерно 15–20 минут, пока крупа не станет мягкой.\n'
         '4. Добавьте соль и сахар, перемешайте. Продолжайте варить ещё несколько минут.\n'
         '5. Снимите с огня, накройте крышкой и дайте настояться 10–15 минут.\n'
         '6. Перед подачей добавьте кусочек сливочного масла.',
         '40', 130, 80,
         'https://avatars.mds.yandex.net/i?id=c6b0cd3ecaaa5258de1b8d6dcb83ae3577518875-5573137-images-thumbs&n=13'),
        ('Пшенная каша на молоке', 'В мультиварке',
         'Пшено — 1 мультистакан\nМолоко — 2 мультистакана\nВода — 2 мультистакана\nСахар — 2 ч. л. (или по вкусу)\nСоль — 1/3 ч. л. (или по вкусу)\nСливочное масло — 30 г',
         '1. Пшено тщательно промойте под проточной водой до прозрачности. Можно залить промытую крупу кипящей водой на 5 минут, а затем снова промыть — это гарантированно уберёт горечь.\n'
         '2. Переложите пшено в чашу мультиварки. Влейте тёплое прокипячённое молоко и тёплую кипячёную воду. Добавьте соль и сахар, перемешайте.\n'
         '3. Закройте крышку. Выберите программу «Молочная каша». Если такой нет, подойдут «Крупа», «Каша» или «Мультиповар» при температуре около 90 °C. Установите время примерно на 1 час.\n'
         '4. После сигнала откройте крышку, добавьте сливочное масло и хорошо перемешайте.\n'
         '5. Снова закройте крышку и оставьте кашу в режиме «Подогрев» на 10–15 минут.',
         '70', 120, 70,
         'https://rutxt.ru/files/16674/9d08251116.JPG'),
        ('Горячие бутерброды с сыром и яйцами', 'В микроволновке',
         'Хлеб белый — 2 ломтика\nСыр твёрдый — 80 г\nСоль — по вкусу\nЯйца — 2 шт.\nМасло сливочное — 1 ч. л.',
         '1. Форму смазать сливочным маслом. В форму выложить хлеб.\n'
         '2. Твёрдый сыр натереть на крупной тёрке. Посыпать им ломтики хлеба.\n'
         '3. В «шапочке» из тёртого сыра сделать углубление и аккуратно вбить туда яйца.\n'
         '4. Форму с бутербродами поставить в микроволновку и запекать при полной мощности 2 минуты.',
         '10', 100, 100,
         'https://media.ovkuse.ru/images/recipes/a39f290c-eff3-4609-8694-ecd262b03b44/a39f290c-eff3-4609-8694-ecd262b03b44_242_242.webp'),
        ('Творожная запеканка с манкой', 'В микроволновке',
         'Творог — 180 г\nСахар — 1 ст. л.\nМанка — 1 ст. л.\nЯйца — 1 шт.\nМасло растительное — 1 ч. л.',
         '1. В глубокой миске смешайте творог, вбейте яйцо и добавьте сахар.\n'
         '2. Затем добавьте манную крупу и разрыхлитель.\n'
         '3. С помощью миксера (или простого венчика) перемешайте творожную массу до однородности.\n'
         '4. Форму, пригодную для запекания в микроволновой печи, смажьте небольшим количеством подсолнечного масла. Выложите творожную массу в форму так, чтобы от края оставалось 2–3 сантиметра.\n'
         '5. Запеканку отправьте в микроволновую печь. Запекать блюдо 10 минут на мощности 800 Вт.',
         '15', 180, 150,
         'https://static.1000.menu/res/640/img/content-v2/62/8e/979/tvorojnaya-zapekanka-v-mikrovolnovke_1603870426_8_max.jpg'),
        # Борщ
        ('Борщ', 'На плите',
         'Свинина на кости — 600 г\nСвекла — 2 шт.\nКапуста — ½ кочана\nКартофель — 3 шт.\nРепчатый лук — 2 шт.\nМорковь — 1 шт.\nТоматная паста — 2 ст. л.\nЧеснок — 4 зубчика\nЛавровый лист — 2 шт.\nСоль — 2 ч. л.\nЧёрный перец молотый — 1 ч. л.\nВода — около 2,4 л\nСметана и зелень — для подачи',
         '1. Бульон. Положите свинину на кости в кастрюлю, залейте водой и варите на медленном огне примерно 2 часа, периодически снимая пенку. За час до конца варки добавьте разрезанную пополам луковицу — бульон будет насыщеннее. Готовое мясо достаньте, срежьте мякоть с кости и нарежьте небольшими кусочками.\n'
         '2. Овощи. Нарежьте капусту и картофель небольшими кубиками. Лук измельчите, морковь натрите на крупной тёрке. Чеснок пропустите через пресс. Свеклу нарежьте соломкой или натрите на средней тёрке.\n'
         '3. Сборка супа. В кипящий бульон добавьте картофель, а через 5 минут — капусту. Варите на среднем огне до полуготовности овощей, примерно 15 минут.\n'
         '4. Зажарка. На сковороде с растительным маслом обжарьте лук до мягкости, добавьте морковь, затем свеклу и прогревайте 5 минут. В конце добавьте томатную пасту и тушите ещё 3 минуты.\n'
         '5. Финал. Переложите зажарку в кастрюлю, варите 5–10 минут. Добавьте чеснок, мясо, лавровый лист, соль и перец. Перемешайте, выключите огонь и дайте борщу настояться под крышкой 10–15 минут.',
         '180', 100, 360,
         'https://cdn.food.ru/unsigned/fit/640/480/ce/0/czM6Ly9tZWRpYS9waWN0dXJlcy8yMDI1MDQwNi8zdXg5WVouanBlZw.webp'),
        ('Борщ', 'В мультиварке',
         'Мясо (говядина, свинина или курица) — 400 г\nСвекла — 2 шт.\nМорковь — 1 шт.\nЛук — 1 шт.\nКапуста — 300 г\nКартофель — 5 шт.\nТоматная паста — 2 ст. л.\nЧеснок — 3 зубчика\nРастительное масло — 30 мл\nУксус столовый — 1,5 ст. л.\nСахар — 2 ч. л.\nЛавровый лист — 2 шт.\nСоль и специи — по вкусу\nВода (кипяток) — 3 л',
         '1. Обжарка мяса. Включите мультиварку в режиме «Жарка». Влейте масло, разогрейте и выложите нарезанное кусочками мясо. Обжаривайте до испарения жидкости и лёгкой румяной корочки.\n'
         '2. Овощи — первая партия. Добавьте нарезанный кубиками лук и тёртую морковь. Жарьте вместе с мясом 5 минут.\n'
         '3. Свекла. Добавьте тёртую свеклу и готовьте ещё 15 минут. Затем положите томатную пасту, сахар, соль и специи. Влейте уксус — он помогает свекле сохранить яркий цвет. Перемешайте и готовьте ещё 3 минуты.\n'
         '4. Сборка. Добавьте в чашу нарезанный кубиками картофель и тонко нашинкованную капусту. Залейте кипятком. Добавьте измельчённый чеснок и лавровый лист. Отрегулируйте соль.\n'
         '5. Тушение. Установите режим «Суп» или «Тушение» и готовьте до звукового сигнала (обычно 40–60 минут). После — оставьте на режиме «Подогрев» ещё на 15–20 минут.',
         '150', 98, 270,
         'https://img.povar.ru/main-micro/c1/18/57/1e/borsh_v_multivarke-880164.jpg'),


        # Рассольник
        ('Рассольник', 'На плите',
         'Говядина на кости — 500 г\nПерловая крупа — 80 г\nКартофель — 3–4 шт.\nСолёные (не маринованные!) огурцы — 3–4 шт.\nОгуречный рассол — 100–150 мл\nРепчатый лук — 1 шт.\nМорковь — 1 шт.\nРастительное масло — 2 ст. л.\nВода — 2,5 л\nЛавровый лист — 1 шт.\nЧёрный молотый перец — по вкусу\nСоль, свежий укроп, сметана — для подачи',
         '1. Бульон. Положите говядину в кастрюлю, залейте холодной водой, доведите до кипения и снимите пену. Варите на медленном огне около 2 часов. Готовое мясо достаньте, остудите, отделите от кости и нарежьте небольшими кусочками. Бульон процедите.\n'
         '2. Перловка. Промойте крупу, залейте горячей водой на 1 час. Затем слейте воду, залейте холодной и варите около 30 минут до мягкости.\n'
         '3. Овощи. Картофель нарежьте кубиками, лук мелко нашинкуйте, морковь натрите на крупной тёрке. Солёные огурцы нарежьте кубиками или тонкой соломкой.\n'
         '4. Зажарка. Разогрейте масло на сковороде, обжарьте лук и морковь около 5 минут до мягкости. Добавьте огурцы и готовьте ещё 3–5 минут.\n'
         '5. Сборка. Доведите процеженный бульон до кипения, добавьте картофель и варите 10 минут. Затем положите перловку, зажарку с огурцами и нарезанное мясо. Влейте огуречный рассол, добавьте лавровый лист и перец. Варите на медленном огне ещё 10–15 минут.\n'
         '6. Финал. Соль добавляйте в самом конце — огурцы и рассол уже солёные. Выключите огонь, накройте крышкой и дайте настояться 10–15 минут.',
         '150', 70, 600,
         'https://s0.rbk.ru/v6_top_pics/resized/600xH/media/img/0/27/277876526846270.webp'),
        ('Рассольник', 'В мультиварке',
         'Свинина — 250 г\nПерловая крупа — 0,5 стакана\nКартофель — 5 шт.\nЛук репчатый — 1 шт.\nМорковь — 1 шт.\nСолёные огурцы — 2–3 шт.\nТоматная паста — 0,5 ст. л.\nРастительное масло — 3 ст. л.\nЛавровый лист — 1 шт.\nСвежий укроп — 1 пучок\nСоль — по вкусу\nВода — 2 л',
         '1. Подготовка. Перловку заранее замочите на 2–3 часа. Мясо нарежьте небольшими кусочками. Лук мелко порежьте, морковь натрите на тёрке, огурцы нарежьте кубиками. Картофель нарежьте мелкими кубиками.\n'
         '2. Обжарка мяса. Включите мультиварку в режиме «Жарка» на 20 минут. Влейте масло, выложите мясо и обжаривайте 12 минут, периодически перемешивая.\n'
         '3. Овощи. Добавьте к мясу морковь, лук, томатную пасту и нарезанные огурцы. Перемешайте и готовьте оставшиеся 8 минут на том же режиме.\n'
         '4. Сборка. Промытую перловку и нарезанный картофель отправьте в чашу. Долейте воды до верхней отметки. Переключите на режим «Тушение» на 1,5 часа.\n'
         '5. Финал. За 5 минут до готовности добавьте мелко нарезанный укроп, лавровый лист и соль по вкусу. После сигнала дайте супу настояться на подогреве 10 минут.',
         '180', 60, 275,
         'https://img.iamcook.ru/old/upl/recipes/cat/u-6edcd8e78c6c5095bd0dbea5c85dbdcd.JPG'),
        ('Гороховый суп', 'На плите',
         'Говядина на кости — 350 г\nГорох (колотый) — 1 стакан (около 205 г)\nКартофель — 3 шт.\nЛук репчатый — 1 шт.\nМорковь — 1 шт.\nРастительное масло — 2 ст. л.\nСоль — примерно 1 ч. л.\nЧёрный молотый перец — по вкусу\nЛавровый лист — 1 шт.\nУкроп — небольшой пучок\nДля подачи: сухарики по желанию',
         '1. Промойте горох несколько раз, пока вода не станет прозрачной. Замочите его на пару часов (а лучше на ночь) — так он сварится быстрее.\n'
         '2. В кастрюлю положите мясо и горох, залейте примерно 1,5 литрами воды. Доведите до кипения, снимите пену и варите под крышкой на минимальном огне около часа.\n'
         '3. Нарежьте картофель небольшими брусочками и добавьте в кастрюлю, когда горох станет мягким. Варите ещё 10–15 минут.\n'
         '4. Пока варится суп, мелко нарежьте лук и натрите морковь. Обжарьте их на растительном масле около 5 минут до мягкости.\n'
         '5. Достаньте мясо из бульона, немного остудите, нарежьте кусочками и верните в кастрюлю. Добавьте зажарку, лавровый лист, соль и перец. Варите ещё около 5 минут.\n'
         '6. Мелко нарежьте укроп и добавьте в суп. Перемешайте, доведите до кипения и отключите огонь. Дайте супу настояться под крышкой 10–15 минут перед подачей.',
         '90', 170, 285,
         'https://cdn.food.ru/unsigned/fit/640/480/ce/0/czM6Ly9tZWRpYS9waWN0dXJlcy8yMDI0MDUxNS8zUGJmbVouanBlZw.webp'),
        ('Гороховый суп', 'В мультиварке',
         'Свиной окорок — 300 г (можно заменить на грудинку или шею)\nГорох колотый — 1 стакан (около 175 г)\nКартофель — 3 шт.\nМорковь — 1 шт.\nЛук репчатый — 1 шт.\nРастительное масло — 1 ст. л.\nСоль — примерно 0,5 ч. л.\nЧёрный молотый перец — по вкусу\nВода — около 1,4 л (7 стаканов)',
         '1. Промойте горох и залейте его стаканом воды.\n'
         '2. Нарежьте свинину и картофель небольшими кубиками, морковь — тонкой соломкой, лук — мелкими кусочками.\n'
         '3. В чашу мультиварки налейте масло и включите режим «Жарка». Обжарьте лук до золотистого цвета, затем добавьте свинину и жарьте до появления лёгкой румяной корочки. После этого добавьте морковь и обжаривайте всё вместе ещё около 10 минут.\n'
         '4. Добавьте к мясу и овощам картофель и горох (вместе с водой, в которой он замачивался). Посолите, поперчите.\n'
         '5. Влейте в чашу оставшуюся воду, закройте крышку и включите режим «Тушение» на 1 час.\n'
         '6. После сигнала дайте супу постоять в режиме «Подогрев» 10 минут. Разливайте по тарелкам, можно посыпать ржаными сухариками.',
         '90', 80, 200,
         'https://cdn.food.ru/unsigned/fit/640/480/ce/0/czM6Ly9tZWRpYS9waWN0dXJlcy8yMDIzMDkxNi8zRnpyQ0ouanBlZw.webp'),
        ('Суп с фрикадельками', 'На плите',
         'Для фрикаделек: мясной фарш — 400–500 г; лук репчатый — 1 шт.; чеснок — 1–2 зубчика; яйцо куриное — 1 шт.; соль, чёрный молотый перец — по вкусу\nДля супа: картофель — 3–4 шт.; морковь — 1 шт.; лук репчатый — 1 шт.; лавровый лист — 1–2 шт.; перец горошком — несколько штук; зелень (укроп, петрушка) — небольшой пучок; вода — 2,5–3 л; растительное масло — 1–2 ст. л. для зажарки',
         '1. Сделайте фрикадельки. Мелко нарежьте или натрите лук, чеснок пропустите через пресс. Добавьте к фаршу лук, чеснок, яйцо, соль и перец. Вымешивайте руками 3–4 минуты, чтобы масса стала липкой и однородной. Можно отбить: поднять комок фарша и с силой бросить обратно в миску несколько раз. Формируйте шарики, смачивая руки холодной водой.\n'
         '2. Сварите основу. В кастрюлю налейте воду, доведите до кипения, посолите. Добавьте нарезанный кубиками картофель и варите примерно 10 минут.\n'
         '3. Приготовьте зажарку. Пока варится картошка, нарежьте лук кубиком, морковь натрите на крупной тёрке. Обжарьте лук на растительном масле до прозрачности, затем добавьте морковь и жарьте ещё около 5 минут, помешивая.\n'
         '4. Добавьте фрикадельки. Когда картофель станет полумягким, аккуратно опустите в суп фрикадельки по одной. Дайте шарикам «схватиться» 2–3 минуты, не перемешивайте сразу. После закипания варите около 5 минут.\n'
         '5. Завершите приготовление. Добавьте зажарку, лавровый лист и перец горошком. Варите ещё 7–10 минут на небольшом огне. Выключите огонь, накройте кастрюлю крышкой и дайте супу настояться 10–15 минут перед подачей.',
         '80', 60, 430,
         'https://fissman.ru/upload/dev2fun.imagecompress/webp/resize_cache/iblock/cb0/itm93xppwml0hxyeg0aq2x6wppachyom/800_800_1/sup_s_frikadelkami.webp'),
        ('Суп с фрикадельками', 'В мультиварке',
         'Вода — 2 л\nКартофель — 4 шт.\nМорковь — 1 шт.\nРепчатый лук — 1 шт.\nЛавровый лист — 1 шт.\nРастительное масло — 2 ст. л.\nПетрушка — небольшой пучок (для подачи)\nСоль, чёрный молотый перец — по вкусу\nДля фрикаделек: свиной фарш — 400 г; куриное яйцо — 1 шт.; рис — 70 г; приправа к мясу — по вкусу',
         '1. Подготовьте овощи. Картофель, морковь и лук вымойте и почистите. Петрушку ополосните и обсушите, затем мелко нарубите.\n'
         '2. Сделайте фрикадельки. В отдельной ёмкости смешайте фарш с яйцом. Добавьте промытый рис и приправу, посолите, поперчите и тщательно перемешайте до однородной массы. Мокрыми руками сформируйте небольшие шарики.\n'
         '3. Приготовьте основу в мультиварке. В чаше мультиварки разогрейте растительное масло в режиме «Жарка». Выложите мелко нарезанный лук и обжарьте до золотистости. Затем добавьте тёртую морковь и пассеруйте ещё около 5 минут.\n'
         '4. Добавьте остальные ингредиенты. Выложите в чашу картофель (крупными брусочками) и фрикадельки. Залейте водой.\n'
         '5. Сварите суп. Установите режим «Суп» и задайте время примерно 20 минут.\n'
         '6. Завершите. Сразу после завершения программы посыпьте суп мелко нарезанной петрушкой, добавьте лавровый лист. При необходимости досолите и поперчите. Оставьте готовый суп в мультиварке ещё на 5 минут, не открывая крышку.',
         '70', 68, 370,
         'https://cdn.food.ru/unsigned/fit/640/480/ce/0/czM6Ly9tZWRpYS9waWN0dXJlcy8yMDIzMDkxOC8zaVF3ckQuanBlZw.webp'),
        ('Грибной суп', 'На плите',
         'Грибы свежие (шампиньоны, белые или другие) — 200 г\nКартофель — 3–4 средних клубня\nЛук репчатый — 2 шт.\nМорковь — 1 шт.\nВода — около 1,5 л\nРастительное масло — 1–2 ст. л.\nСметана — 2 ст. л. (по желанию, для заправки)\nМука — 2 ст. л. (для заправки)\nСоль, чёрный молотый перец — по вкусу\nЗелень (укроп, петрушка) — небольшой пучок',
         '1. Грибы очистите, промойте и отварите. Если берёте свежие белые — варите около 20–30 минут, снимая пену. Шампиньоны можно просто промыть и нарезать, дополнительной долгой варки не требуется.\n'
         '2. Картофель очистите и нарежьте небольшими кубиками. Отправьте его в кастрюлю с кипящей водой, слегка посолите и варите примерно 10–12 минут до полуготовности.\n'
         '3. Пока варится картофель, приготовьте зажарку. На сковороде разогрейте масло, обжарьте мелко нарезанный лук до прозрачности (3–4 минуты), затем добавьте тёртую морковь и жарьте ещё 3–4 минуты. Добавьте к овощам нарезанные грибы и обжаривайте, пока не выпарится лишняя влага и грибы не подрумянятся.\n'
         '4. Переложите зажарку с грибами в кастрюлю к картофелю. Добавьте лавровый лист и перец горошком. Варите всё вместе ещё 10–15 минут на слабом огне.\n'
         '5. Для заправки смешайте сметану с мукой до однородной массы. Когда картофель и грибы будут готовы, аккуратно влейте эту смесь в суп, постоянно помешивая, чтобы не было комочков.\n'
         '6. За 2–3 минуты до конца попробуйте суп на соль и при необходимости скорректируйте вкус. Выключите огонь, накройте кастрюлю крышкой и дайте супу настояться 10 минут. При подаче посыпьте мелко нарезанной зеленью, можно добавить ложку сметаны.',
         '90', 137, 200,
         'https://avatars.mds.yandex.net/i?id=05863b4e7410f789f909315bf98fc3f87eb6841c-12937750-images-thumbs&n=13'),
        ('Грибной суп', 'В мультиварке',
         'Шампиньоны свежие — 180 г\nКартофель — 5 средних клубней\nМорковь — 1 небольшая\nЛук репчатый — 0,5 шт.\nВода — 1–1,5 л\nРастительное масло — 1 ст. л.\nЛавровый лист — 1 шт.\nСоль, чёрный молотый перец — по вкусу\nУкроп свежий (измельчённый) — 1,5 ст. л.\nСметана — для подачи',
         '1. Очистите и мелко нарежьте половину луковицы. В чашу мультиварки влейте растительное масло. Включите программу «Жарка». Когда масло разогреется, переложите в чашу лук и обжаривайте его, помешивая, около 5 минут (крышку не закрывайте).\n'
         '2. Очистите морковь, нарежьте тонкой соломкой и добавьте к обжаренному луку. Обжаривайте овощи вместе ещё примерно 5 минут.\n'
         '3. Ополосните шампиньоны, нарежьте тонкими пластинками и выложите в чашу к овощам. Перемешайте и обжаривайте ещё около 10 минут. Программа «Жарка» завершена.\n'
         '4. Очистите картофель и нарежьте небольшими кубиками. Выложите его в чашу к обжаренным овощам и грибам.\n'
         '5. По вкусу посолите, добавьте лавровый лист и влейте тёплую кипячёную воду. Закройте крышку мультиварки.\n'
         '6. Установите программу «Суп» на 40 минут. Когда программа завершится, откройте мультиварку, поперчите суп и добавьте измельчённый свежий укроп.\n'
         '7. Разливайте готовый суп по тарелкам, дополняя каждую порцию ложкой сметаны.',
         '80', 100, 200,
         'https://rutxt.ru/files/16908/a8d2a118f6.JPG'),
        ('Рыбный суп из консерв', 'На плите',
         'Рыбные консервы (сайра, сардины, горбуша — на ваш вкус) — 1 банка\nКартофель — 2–3 средние клубня\nРис — 2–3 ст. л. (можно заменить на перловку или обойтись без крупы)\nЛук репчатый — 1 шт.\nМорковь — 1 шт.\nВода — около 1,5 л\nРастительное масло — 1–2 ст. л.\nЛавровый лист — 1 шт.\nСоль, чёрный перец — по вкусу (в самих консервах уже есть соль)\nЗелень для подачи (укроп, петрушка)',
         '1. Картофель очистите и нарежьте кубиками. Рис промойте.\n'
         '2. В кастрюлю налейте воду, доведите до кипения. Добавьте картофель и рис, варите примерно 12–14 минут.\n'
         '3. Пока варится основа, приготовьте зажарку: на сковороде разогрейте масло, обжарьте мелко нарезанный лук, затем добавьте тёртую морковь и пассеруйте 3–4 минуты.\n'
         '4. Переложите зажарку в кастрюлю к картофелю и рису. Варите ещё около 7–9 минут.\n'
         '5. Откройте банку с консервами. Если кусочки крупные, разомните их вилкой. Добавьте рыбу в суп. Прогрейте всё вместе 3–5 минут.\n'
         '6. Добавьте лавровый лист, посолите и поперчите по вкусу. Поварите ещё около 5 минут.\n'
         '7. Снимите с огня, накройте крышкой и дайте супу немного настояться перед подачей. Разливайте по тарелкам, посыпая зеленью.',
         '60', 50, 250,
         'https://cdn.food.ru/unsigned/fit/640/480/ce/0/czM6Ly9tZWRpYS9waWN0dXJlcy8yMDIzMTExOC9kZzNNYzcuanBlZw.webp'),
        ('Рыбный суп из консерв', 'В мультиварке',
         'Рыбные консервы (например, скумбрия) — 1 банка\nКартофель — 2 средние клубня\nЛук репчатый — 1 шт.\nМорковь — 1 шт.\nЛавровый лист — 1–2 шт.\nСоль, чёрный перец — по вкусу\nГорячая вода — примерно 1–1,2 л\nЗелень для подачи',
         '1. Овощи очистите. Лук нарежьте кубиками, морковь натрите на крупной тёрке.\n'
         '2. В чашу мультиварки выложите лук и морковь. Включите режим «Жарка» и обжаривайте несколько минут (можно без дополнительного масла, если чаша с хорошим антипригарным покрытием).\n'
         '3. Добавьте к овощам нарезанный картофель.\n'
         '4. Откройте банку с консервами. Переложите рыбу в чашу, предварительно удалив крупные кости и размяв вилкой.\n'
         '5. Залейте всё горячей водой, положите лавровый лист.\n'
         '6. Закройте крышку мультиварки. Выберите режим «Суп» или «Варка» и установите время примерно 30 минут.\n'
         '7. После сигнала откройте крышку, попробуйте суп и скорректируйте вкус (соль, перец). Поварите ещё около 10 минут.\n'
         '8. Разливайте по тарелкам, посыпая зеленью.',
         '70', 150, 250,
         'https://cdn.food.ru/unsigned/fit/640/480/ce/0/czM6Ly9tZWRpYS9waWN0dXJlcy8yMDI1MDcwNS8zTGp5dUwuanBlZw.webp'),
        ('Грибной крем-суп', 'На плите',
         'Шампиньоны свежие — 500 г\nЛук репчатый — 1 шт.\nЧеснок — 2 зубчика\nСливочное масло — 1 ст. л.\nМука пшеничная — 2 ст. л.\nГрибной бульон — 750 мл (можно заменить овощным или лёгким куриным)\nСливки 20% — 250 мл\nПриправа «Итальянские травы» — 1 ч. л.\nСоль, чёрный перец — по вкусу',
         '1. Нарежьте лук и чеснок мелкими кубиками, шампиньоны — ломтиками.\n'
         '2. В кастрюле растопите сливочное масло. Обжарьте лук и шампиньоны, помешивая, около 10 минут. Затем добавьте чеснок и готовьте ещё минуту.\n'
         '3. Посыпьте грибы с луком мукой и итальянскими травами, перемешайте. Влейте бульон, доведите до кипения и варите 10 минут. Посолите и поперчите.\n'
         '4. Взбейте суп блендером до однородной кремовой текстуры. Добавьте сливки и прогрейте, не доводя до кипения — иначе сливки могут свернуться. Подавайте горячим, можно с домашними сухариками или тёртым пармезаном.',
         '50', 70, 350,
         'https://images.gastronom.ru/-UErt55RbzFMd-w2FWepf8h3qwKWPwkbTW2HRFiFtoU/pr:recipe-cover-image/g:ce/rs:auto:0:0:0/L2Ntcy9hbGwtaW1hZ2VzL2UxOGVkNzgyLWE1YzMtNDYxNS05ZTkzLTM5YmFjZTJkNzBhMi5qcGc.webp'),
        ('Грибной крем-суп', 'В мультиварке',
         'Шампиньоны — 300 г\nКартофель — 2 шт.\nЛук репчатый — 1 шт.\nСливки 15% — 100 мл\nСливочное масло — 15 г\nСоль, чёрный молотый перец — по вкусу\nМускатный орех молотый — щепотка\nВода — 500 мл',
         '1. Нарежьте грибы, картофель и лук небольшими кусочками.\n'
         '2. В мультиварке выберите режим «Варка». Обжаривайте грибы на сливочном масле около 10 минут, периодически помешивая.\n'
         '3. Добавьте к грибам нарезанный картофель и лук, готовьте в том же режиме ещё 5 минут.\n'
         '4. Влейте воду, выберите режим «Суп» (или «Тушение», «Варка»), установите время примерно 25 минут.\n'
         '5. За несколько минут до конца добавьте соль, перец и мускатный орех.\n'
         '6. Влейте сливки, перемешайте. После завершения программы перебейте суп блендером до однородности.',
         '60', 65, 200,
         'https://www.russianfood.com/dycontent/images_upl/233/sm_232346.jpg'),
        ('Овощной суп', 'На плите',
         'Вода — 1,5 л\nКартофель — 3 средние клубня\nМорковь — 1 крупная\nЛук репчатый — 1 шт.\nБолгарский перец — 1 шт.\nКабачок — около 200 г\nПомидоры — 2 шт. (или 200 г в собственном соку)\nРастительное масло — 1 ст. л.\nСоль — примерно 1 ч. л.\nЧёрный перец — по вкусу\nЛавровый лист — 1 шт.\nЗелень (укроп, петрушка) — по желанию',
         '1. Все овощи вымойте и очистите. Картофель и кабачок нарежьте кубиками среднего размера. Морковь — кружочками или соломкой. Лук — мелким кубиком. Болгарский перец — полосками. Помидоры — кубиками.\n'
         '2. В кастрюле с толстым дном разогрейте растительное масло. Обжарьте лук и морковь 3–4 минуты до мягкости. Затем добавьте болгарский перец и помидоры, тушите ещё около 5 минут.\n'
         '3. Залейте овощи горячей водой. Добавьте картофель и кабачок. Варите на среднем огне 15–20 минут, пока овощи не станут мягкими.\n'
         '4. За 5 минут до готовности добавьте соль, перец и лавровый лист. В конце положите мелко нарезанную зелень. Выключите огонь и дайте супу настояться под крышкой около 10 минут.',
         '60', 50, 200,
         'https://avatars.dzeninfra.ru/get-zen_doc/271828/pub_6959f072b2bf8e79ddfac044_6959f088d6e03c1d00218cb0/scale_1200'),
        ('Овощной суп', 'В мультиварке',
         'Вода — около 1,2 л\nКартофель — 2–3 шт.\nМорковь — 1 шт.\nЛук репчатый — 1 шт.\nБолгарский перец — 1 шт.\nПомидоры — 1–2 шт. (или 1–2 ст. л. томатной пасты)\nРастительное масло — 1–2 ст. л.\nСоль — по вкусу\nЧёрный перец — по вкусу\nЛавровый лист — 1 шт.\nЗелень (укроп, петрушка) — по желанию',
         '1. Овощи вымойте и очистите. Нарежьте картофель, морковь, лук, болгарский перец и помидоры небольшими кусочками.\n'
         '2. В чаше мультиварки включите режим «Жарка». Обжарьте лук и морковь на растительном масле до мягкости (около 3–4 минут). Затем добавьте болгарский перец и помидоры, обжаривайте ещё пару минут.\n'
         '3. Добавьте к овощам картофель, залейте водой. Положите лавровый лист, посолите и поперчите.\n'
         '4. Закройте крышку мультиварки. Выберите режим «Суп» (или «Тушение», «Варка») и установите время примерно 30–40 минут.\n'
         '5. В конце добавьте мелко нарезанную зелень. Дайте супу немного постоять в режиме подогрева перед подачей.',
         '60', 55, 150,
         'https://www.chefmarket.ru/blog/wp-content/uploads/2020/02/vegetable-soup--2000x1200.jpg'),
        ('Щи', 'На плите',
         'Свинина (лопаточная или шейная часть) — 500 г\nКапуста белокочанная — 500 г\nКартофель — 2 шт.\nМорковь — 1 шт.\nЛук репчатый — 1–2 шт.\nТоматная паста — 1 ст. л. (или 2 свежих помидора)\nМасло растительное — 2 ст. л.\nЗелень — 0,5 пучка\nЛавровый лист — 1–2 шт.\nЧеснок (по желанию) — 2–4 зубчика\nПерец молотый — по вкусу\nСоль — 0,5–1 ст. л.\nВода — 2–2,5 л\nСметана — для подачи',
         '1. Мясо вымойте, залейте холодной водой. Доведите до кипения, снимите шумовкой пену. Уменьшите огонь, накройте крышкой и варите до готовности (около часа). Отварное мясо можно вынуть, нарезать кусочками и вернуть в суп.\n'
         '2. Пока варится бульон, подготовьте овощи. Морковь очистите и натрите на крупной тёрке. Лук очистите и нарежьте мелкими кубиками.\n'
         '3. На сковороде разогрейте растительное масло. Обжарьте лук и морковь 2–3 минуты. Добавьте томатную пасту (или свежие помидоры) и тушите ещё 5–7 минут.\n'
         '4. Капусту нарежьте квадратиками или соломкой. Картофель очистите и нарежьте небольшим кубиком.\n'
         '5. В бульон выложите капусту и картофель, доведите до кипения. Если капуста молодая, добавляйте её ближе к концу варки (минут за 7). Зрелую капусту можно класть раньше.\n'
         '6. Добавьте в суп зажарку. Варите при слабом кипении 15–20 минут.\n'
         '7. В конце добавьте молотый перец, лавровый лист и (по желанию) растёртый с солью чеснок. Мелко нарежьте зелень и тоже добавьте в суп. Снимите с огня и дайте настояться 10–15 минут. Подавайте со сметаной.',
         '90', 120, 350,
         'https://www.russianfood.com/dycontent/images_upl/67/sm_66663.jpg'),
        ('Щи', 'В мультиварке',
         'Свиная грудинка — 300–400 г\nКартофель — 3–4 шт.\nЛук репчатый — 1 шт.\nМорковь — 1 шт.\nБолгарский перец — 1 шт.\nКапуста свежая молодая — 300 г (примерно полвилка)\nМасло растительное — 2–3 ст. л.\nПомидор свежий — 1 шт.\nСоль, перец чёрный молотый, специи — по вкусу\nВода горячая — 3 л\nЗелень, сметана — для подачи',
         '1. В чашу мультиварки влейте растительное масло и выложите нарезанную средними кусочками грудинку. Выставьте режим «Жарка» на 10 минут.\n'
         '2. Добавьте нарезанные лук и морковь. Готовьте на том же режиме ещё 10 минут.\n'
         '3. Затем добавьте нарезанный кубиками картофель.\n'
         '4. Влейте горячую воду, посолите по вкусу и перемешайте. Выставьте режим «Тушение» на 1 час.\n'
         '5. За 15 минут до окончания готовки добавьте в суп нашинкованную капусту, нарезанный кубиками помидор и соломкой — болгарский перец. Поперчите, добавьте специи.\n'
         '6. Готовые щи оставьте под закрытой крышкой на 15–20 минут. Подавайте горячими, со сметаной и измельчённой зеленью.',
         '90', 130, 350,
         'https://rutxt.ru/files/6143/20200bc84f.JPG'),
        # Картошка фри
        ('Картошка фри', 'На плите',
         'Картофель — 500 г\nМасло растительное — 2 ст. л.\nСоль, перец — по вкусу',
         '1. Картофель очистить, нарезать соломкой 1×1 см.\n'
         '2. Промыть в холодной воде, обсушить полотенцем.\n'
         '3. Разогреть масло, обжарить до золотистого цвета.\n'
         '4. Выложить на бумажное полотенце, посолить.',
         '30', '250-310', 150,
         'https://static.1000.menu/img/content-v2/18/ca/14461/kartoshka-fri-na-skovorode_1581661860_12_max.jpg'),
        ('Картошка фри', 'В духовке',
         'Картофель — 500 г\nМасло растительное — 2 ст. л.\nСоль, перец — по вкусу',
         '1. Разогреть духовку до 200 °C.\n'
         '2. Картофель нарезать, промыть, обсушить.\n'
         '3. Смешать с маслом, солью, паприкой.\n'
         '4. Выложить на противень в один слой.\n'
         '5. Запекать 25–30 минут, переворачивая через 15 минут.',
         '35', "250-310", 150,
         'https://static.1000.menu/files/user-v2/34/7d/489397/foto/f_09-08-2021-07-20-00.1628493601.jpg'),
        ('Картошка фри', 'В аэрогриле',
         'Картофель — 500 г\nМасло растительное — 2 ст. л.\nСоль, перец — по вкусу',
         '1. Разогреть аэрогриль до 200 °C.\n'
         '2. Подготовленный картофель с маслом выложить в корзину.\n'
         '3. Готовить 15–20 минут, встряхивая каждые 5–7 минут.',
         '25', '250-310', 150,
         'https://menunedeli.ru/wp-content/uploads/2025/09/Kak-sdelat-kartoshku-fri-v-aerogrile-7-1000x667.jpg'),
        ('Картошка фри', 'В микроволновке',
         'Картофель — 500 г\nМасло растительное — 2 ст. л.\nСоль, перец — по вкусу',
         '1. Картофель нарезать, смазать маслом, посолить.\n'
         '2. Выложить на плоскую тарелку в один слой.\n'
         '3. Готовить на максимальной мощности 5–7 минут.\n'
         '4. Для хрустящей корочки можно затем обжарить на сковороде или в аэрогриле 2–3 минуты.',
         '15', '250-310', 150,
         'https://www.koolinar.ru/all_image/recipes/142/142309/recipe_a7f739c6-7b75-4a77-ba50-ea6cd0c8265c.webp'),
        ('Курица с макаронами', 'На плите',
         'Куриное филе — 400 г\nМакароны — 300 г\nЛук — 1 шт.\nМорковь — 1 шт.\nСоль, перец, специи — по вкусу',
         '1. Курицу нарезать кубиками, обжарить до румяности.\n'
         '2. Добавить лук и морковь, жарить 5 минут.\n'
         '3. Влить немного воды или сливок, тушить 10 минут.\n'
         '4. Отварить макароны отдельно, смешать с курицей.',
         '30', '180-220', 435,
         'https://static.1000.menu/files/user-v2/c2/74/917281/foto/f_26-03-2025-12-04-19.1742990661.jpg'),
        ('Курица с макаронами', 'В духовке',
         'Куриное филе — 400 г\nМакароны — 300 г\nЛук — 1 шт.\nМорковь — 1 шт.\nСоль, перец, специи — по вкусу',
         '1. Курицу и овощи обжарить до полуготовности.\n'
         '2. Отварить макароны до аль денте.\n'
         '3. Смешать всё в форме, залить соусом (сливки + сыр).\n'
         '4. Запекать при 180 °C 20–25 минут.',
         '30', '180-220', 435,
         'https://avatars.mds.yandex.net/i?id=cdd49e7d9ace44e261866b9c4640883763d5cafc-4571029-images-thumbs&n=13'),
        ('Курица с макаронами', 'В аэрогриле',
         'Куриное филе — 400 г\nМакароны — 300 г\nЛук — 1 шт.\nМорковь — 1 шт.\nСоль, перец, специи — по вкусу',
         '1. Курицу и овощи обжарить в аэрогриле при 190 °C 15 минут.\n'
         '2. Отварить макароны.\n'
         '3. Смешать, добавить соус, готовить ещё 5–7 минут при 170 °C.',
         '30', '180-220', 435,
         'https://www.russianfood.com/dycontent/images_upl/343/big_342030.jpg'),
        ('Курица с макаронами', 'В микроволновке',
         'Куриное филе — 400 г\nМакароны — 300 г\nЛук — 1 шт.\nМорковь — 1 шт.\nСоль, перец, специи — по вкусу',
         '1. Курицу и овощи нарезать, сложить в посуду для СВЧ.\n'
         '2. Готовить под крышкой 7–10 минут на мощности 800 Вт.\n'
         '3. Отварить макароны, смешать, прогреть 2–3 минуты.',
         '30', '180-220', 435,
         'https://avatars.mds.yandex.net/i?id=2cd2f654ed5f0c3ba0ef2e31c39b18df_l-5273210-images-thumbs&n=13'),
        ('Гречка с молоком', 'На плите',
         'Гречка — 200 г\nВода — 400 мл\nМолоко — 200 мл\nМорковь — 1 шт.\nСоль, сахар — по вкусу',
         '1. Гречку промыть, залить водой, посолить.\n'
         '2. Варить 15–20 минут до готовности.\n'
         '3. Добавить молоко, довести до кипения, варить 2–3 минуты.',
         '20', '110-130', 210,
         'https://static.1000.menu/img/content-v2/1e/7a/21192/grechnevaya-kasha-na-moloke-v-multivarke_1738808726_11_g0ntpjk_max.jpg'),
        ('Гречка с молоком', 'В духовке',
         'Гречка — 200 г\nВода — 400 мл\nМолоко — 200 мл\nМорковь — 1 шт.\nСоль, сахар — по вкусу',
         '1. Гречку и воду (1:2) выложить в горшочки.\n'
         '2. Запекать при 180 °C 30–40 минут.\n'
         '3. Влить молоко, вернуть в духовку на 10 минут.',
         '40', '110-130', 210,
         'https://static.1000.menu/img/content-v2/1e/7a/21192/grechnevaya-kasha-na-moloke-v-multivarke_1738808726_11_g0ntpjk_max.jpg'),
        ('Гречка с молоком', 'В аэрогриле',
         'Гречка — 200 г\nВода — 400 мл\nМолоко — 200 мл\nМорковь — 1 шт.\nСоль, сахар — по вкусу',
         '1. Гречку отварить до полуготовности.\n'
         '2. Переложить в форму, залить молоком.\n'
         '3. Готовить при 170 °C 15 минут.',
         '20', '110-130', 210,
         'https://static.1000.menu/img/content-v2/1e/7a/21192/grechnevaya-kasha-na-moloke-v-multivarke_1738808726_11_g0ntpjk_max.jpg'),
        ('Гречка с молоком', 'В микроволновке',
         'Гречка — 200 г\nВода — 400 мл\nМолоко — 200 мл\nМорковь — 1 шт.\nСоль, сахар — по вкусу',
         '1. Гречку залить водой (1:2), накрыть крышкой.\n'
         '2. Готовить 5–7 минут на мощности 800 Вт.\n'
         '3. Добавить молоко, прогреть ещё 2–3 минуты.',
         '15', '110-130', 210,
         'https://static.1000.menu/img/content-v2/1e/7a/21192/grechnevaya-kasha-na-moloke-v-multivarke_1738808726_11_g0ntpjk_max.jpg'),
        ('Макароны с сыром', 'На плите',
         'Сыр — 150 г\nМакароны — 300 г\nСливочное масло — 30 г\nМолоко — 100 мл\nСоль, перец — по вкусу',
         '1. Отварить макароны.\n'
         '2. Слить воду, добавить масло, молоко, тёртый сыр.\n'
         '3. Перемешать, прогреть 2–3 минуты.',
         '10', '250-330', 210,
         'https://img.povar.ru/uploads/45/b1/a7/de/makaroni_s_sirom_i_molokom-633994.jpg'),
        ('Макароны с сыром', 'В духовке',
         'Сыр — 150 г\nМакароны — 300 г\nСливочное масло — 30 г\nМолоко — 100 мл\nСоль, перец — по вкусу',
         '1. Отварить макароны.\n'
         '2. Смешать с сыром, маслом, молоком.\n'
         '3. Выложить в форму, посыпать сыром.\n'
         '4. Запекать при 180 °C 15–20 минут.',
         '20', '250-330', 210,
         'https://img.povar.ru/mobile/f1/00/49/ee/makaroni_s_yaicom_i_sirom-102707.jpeg'),
        ('Макароны с сыром', 'В аэрогриле',
         'Сыр — 150 г\nМакароны — 300 г\nСливочное масло — 30 г\nМолоко — 100 мл\nСоль, перец — по вкусу',
         '1. Отварить макароны.\n'
         '2. Смешать с сыром и маслом.\n'
         '3. Готовить при 180 °C 8–10 минут.',
         '15', '250-330', 210,
         'https://iv.okcdn.ru/i?r=BEH7dJIjJJO0pjyIf46vcZ9AcksslveO_zj6ASPrA5gI0QolD8H6_Hw5L7IyFvJzSQK5CqdNleAEysdLnA60zUgQ&fn=external_8'),
        ('Макароны с сыром', 'В микроволновке',
         'Сыр — 150 г\nМакароны — 300 г\nСливочное масло — 30 г\nМолоко — 100 мл\nСоль, перец — по вкусу',
         '1. Отварить макароны.\n'
         '2. Смешать с сыром и молоком в посуде для СВЧ.\n'
         '3. Готовить 3–4 минуты на мощности 800 Вт, перемешать.',
         '10', '250-330', 210,
         'https://pic.rtbcdn.ru/video/96/92/9692aa977ebe6e579529bb336347cec4.jpg'),
        ('Паста карбонара', 'На плите',
         'Сыр пармезан — 50 г\nСпагетти — 300 г\nБекон — 150 г\nЯйца — 2 шт.\nСливки — 100 мл\nСоль, перец, чеснок — по вкусу',
         '1. Отварить спагетти до аль денте.\n'
         '2. Бекон обжарить с чесноком.\n'
         '3. Взбить яйца с сыром и сливками.\n'
         '4. Смешать горячие спагетти с беконом, снять с огня, влить яичную смесь, быстро перемешать.',
         '20', '300-380', 330,
         'https://avatars.mds.yandex.net/i?id=2fb4da3e42e933b299c1e14ca3edf028_l-5453486-images-thumbs&n=13'),
        ('Паста карбонара', 'В духовке',
         'Сыр пармезан — 50 г\nСпагетти — 300 г\nБекон — 150 г\nЯйца — 2 шт.\nСливки — 100 мл\nСоль, перец, чеснок — по вкусу',
         '1. Отварить спагетти.\n'
         '2. Смешать с беконом и соусом.\n'
         '3. Выложить в форму, посыпать сыром.\n'
         '4. Запекать при 180 °C 10–15 минут.',
         '20', '300-380', 330,
         'https://images.news.ru/2026/03/26/0XNrt1azTHr7lSro6to1BRMXRReiEZ3yYOlnz21G_780.png'),
        ('Паста карбонара', 'В аэрогриле',
         'Сыр пармезан — 50 г\nСпагетти — 300 г\nБекон — 150 г\nЯйца — 2 шт.\nСливки — 100 мл\nСоль, перец, чеснок — по вкусу',
         '1. Отварить спагетти.\n'
         '2. Смешать с беконом и соусом.\n'
         '3. Готовить при 170 °C 7–10 минут.',
         '15', '300-380', 330,
         'https://www.koolinar.ru/all_image/article/4/4292/article-66e51611-0a81-4aea-a58c-3f6c87d36e20_large.webp'),
        ('Паста карбонара', 'В микроволновке',
         'Сыр пармезан — 50 г\nСпагетти — 300 г\nБекон — 150 г\nЯйца — 2 шт.\nСливки — 100 мл\nСоль, перец, чеснок — по вкусу',
         '1. Отварить спагетти.\n'
         '2. Смешать с беконом и соусом в посуде для СВЧ.\n'
         '3. Готовить 2–3 минуты на мощности 700–800 Вт, перемешать.',
         '15', '300-380', 330,
         'https://cdn.food.ru/unsigned/fit/640/480/ce/0/czM6Ly9tZWRpYS9waWN0dXJlcy8yMDI1MDIxMS9ScEJNcEEuanBlZw.jpg'),
        ('Жареные кабачки с мясом', 'На плите',
         'Мясо (свинина/говядина) — 400 г\nКабачки — 2 шт.\nЛук — 1 шт.\nСоль, перец, масло — по вкусу',
         '1. Мясо нарезать, обжарить до готовности.\n'
         '2. Добавить лук, жарить 5 минут.\n'
         '3. Кабачки нарезать кружками, обжарить отдельно.\n'
         '4. Смешать, тушить 10 минут.',
         '20', '150-200', '250-370',
         'https://img.povar.ru/mobile/33/9c/8b/d7/svinina_s_kabachkami-20295.jpg'),
        ('Жареные кабачки с мясом', 'В духовке',
         'Мясо (свинина/говядина) — 400 г\nКабачки — 2 шт.\nЛук — 1 шт.\nСоль, перец, масло — по вкусу',
         '1. Мясо и кабачки нарезать.\n'
         '2. Сложить в форму слоями, посолить, поперчить.\n'
         '3. Запекать при 190 °C 35–40 минут.',
         '40', '150-200', '250-370',
         'https://i.ytimg.com/vi/JzCwNirEeKQ/maxresdefault.jpg'),
        ('Жареные кабачки с мясом', 'В аэрогриле',
         'Мясо (свинина/говядина) — 400 г\nКабачки — 2 шт.\nЛук — 1 шт.\nСоль, перец, масло — по вкусу',
         '1. Мясо обжарить при 200 °C 15 минут.\n'
         '2. Добавить кабачки, готовить ещё 10–12 минут.',
         '30', '150-200', '250-370',
        'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTYHvseZwauXmIA9T_wR-mqn4nLjTVmFhp8VxDNJYD7DQ&s=10'),
        ('Жареные кабачки с мясом', 'В микроволновке',
         'Мясо (свинина/говядина) — 400 г\nКабачки — 2 шт.\nЛук — 1 шт.\nСоль, перец, масло — по вкусу',
         '1. Мясо и кабачки нарезать, сложить в посуду для СВЧ.\n'
         '2. Готовить под крышкой 10–12 минут на мощности 800 Вт.\n'
         '3. Затем можно обжарить на сковороде для корочки.',
         '20', '150-200', '250-370',
         'https://rutxt.ru/files/3817/final/c049637a39.jpg'),
        ('Фунчоза', 'На плите',
         'Фунчоза — 200 г\nПерец, морковь, лук — 300 г\nМясо/курица — 200 г\nСоевый соус — 3 ст. л.\nМасло, чеснок — по вкусу',
         '1. Фунчозу залить кипятком на 5–7 минут, слить воду.\n'
         '2. Мясо обжарить, добавить овощи, жарить 5–7 минут.\n'
         '3. Добавить фунчозу, соевый соус, чеснок, перемешать, прогреть 2–3 минуты.',
         '20', '120-160', 295,
         'https://recfood.ru/wp-content/uploads/2020/07/funchoza-s-kurinoi-ghrudkoi-i-ovoshchami-osnovnoe-foto-retsepta.jpg'),
        ('Фунчоза', 'В духовке',
         'Фунчоза — 200 г\nПерец, морковь, лук — 300 г\nМясо/курица — 200 г\nСоевый соус — 3 ст. л.\nМасло, чеснок — по вкусу',
         '1. Фунчозу отварить.\n'
         '2. Мясо и овощи обжарить.\n'
         '3. Смешать всё в форме, запекать при 180 °C 15 минут.',
         '25', '120-160', 295,
         'https://recfood.ru/wp-content/uploads/2020/07/funchoza-s-kurinoi-ghrudkoi-i-ovoshchami-osnovnoe-foto-retsepta-1024x725.jpg'),
        ('Фунчоза', 'В аэрогриле',
         'Фунчоза — 200 г\nПерец, морковь, лук — 300 г\nМясо/курица — 200 г\nСоевый соус — 3 ст. л.\nМасло, чеснок — по вкусу',
         '1. Мясо и овощи готовить при 190 °C 12–15 минут.\n'
         '2. Добавить фунчозу и соус, готовить ещё 5 минут.',
         '20', '120-160', 295,
         'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQvs1uU4piXw3SfG4M9lyIAJXJErhDUgW4O6OaSyIZ5ZQfKkVIgLz3UWco&s=10'),
        ('Фунчоза', 'В микроволновке',
         'Фунчоза — 200 г\nПерец, морковь, лук — 300 г\nМясо/курица — 200 г\nСоевый соус — 3 ст. л.\nМасло, чеснок — по вкусу',
         '1. Фунчозу залить кипятком, оставить на 5 минут.\n'
         '2. Мясо и овощи нарезать, готовить в СВЧ 7–8 минут.\n'
         '3. Смешать с фунчозой и соусом, прогреть 2 минуты.',
         '15', '120-160', 295,
         'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTKjD4mGlRklcGYmawd7Vi3AAgYskyze5So9P-h9D2AujrCxqvv6YDkAg8&s=10'),
        ('Пюре с куриной котлеткой', 'На плите',
         'Картофель — 500 г\nМолоко — 100 мл\nМасло — 30 г\nФарш куриный — 400 г\nЛук — 1 шт.\nЯйцо — 1 шт.\nХлеб — 50 г\nСоль, перец — по вкусу',
         '1. Картофель отварить, размять с молоком и маслом.\n'
         '2. Фарш смешать с луком, яйцом, размоченным хлебом.\n'
         '3. Сформировать котлеты, обжарить по 4–5 минут с каждой стороны.',
         '25', '180-230', 180,
         'https://buuza27.ru/wp-content/uploads/2025/10/pyure-s-kotletoj-800x800.webp'),
        ('Пюре с куриной котлеткой', 'В духовке',
         'Картофель — 500 г\nМолоко — 100 мл\nМасло — 30 г\nФарш куриный — 400 г\nЛук — 1 шт.\nЯйцо — 1 шт.\nХлеб — 50 г\nСоль, перец — по вкусу',
         '1. Пюре приготовить заранее.\n'
         '2. Котлеты выложить на противень, запекать при 190 °C 20–25 минут.\n'
         '3. Подавать с пюре.',
         '30', '180-230', 180,
         'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRg2vOtkMZMukyZRo-7Fb7qbLZiBVc_Fn1N3SI_nDoHIZ8shRd9_KGXKjs&s=10'),
        ('Пюре с куриной котлеткой', 'В аэрогриле',
         'Картофель — 500 г\nМолоко — 100 мл\nМасло — 30 г\nФарш куриный — 400 г\nЛук — 1 шт.\nЯйцо — 1 шт.\nХлеб — 50 г\nСоль, перец — по вкусу',
         '1. Котлеты готовить при 190 °C 15–18 минут.\n'
         '2. Пюре приготовить отдельно.',
         '25', '180-230', 180,
         'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTkNRUfxnwHt1S9btQ6bQ_JDr7sIeAuJhXNKgrtqP1mhg&s=10'),
        ('Пюре с куриной котлеткой', 'В микроволновке',
         'Картофель — 500 г\nМолоко — 100 мл\nМасло — 30 г\nФарш куриный — 400 г\nЛук — 1 шт.\nЯйцо — 1 шт.\nХлеб — 50 г\nСоль, перец — по вкусу',
         '1. Картофель отварить или запечь в СВЧ, размять.\n'
         '2. Котлеты готовить в СВЧ под крышкой 7–8 минут на мощности 800 Вт, затем обжарить для корочки.',
         '25', '180-230', 180,
         'https://eda.yandex.ru/images/3806466/cde976615ed249618536ea23dab4fc93-216x188.jpeg'),
        ('Индейка на пару', 'В мультиварке',
         'Филе индейки — 400 г\nЦветная капуста — 100 г\nКабачок — 1 шт.\nМорковь — 1 шт.\nПомидоры — 2 шт.\nСоль, специи — по вкусу',
         '1. Мясо обмойте, обсушите и нарежьте на небольшие кусочки поперёк волокон — так оно будет мягче. Посолите и сдобрите индейку специями.\n'
         '2. Морковь, кабачки и помидоры очистите и нарежьте кружочками толщиной примерно полсантиметра.\n'
         '3. Возьмите корзину для варки на пару. На самый низ выложите кусочки индейки. Поверх неё положите нарезанные овощи, в том числе и замороженные. Посолите их.\n'
         '4. В чашу мультиварки налейте чистую воду. Установите корзину с мясом и овощами.\n'
         '5. Выставите программу варки на пару, время 60 минут. Она может называться по-разному в зависимости от модели мультиварки.',
         '1 ч 10 мин', 50, 500,
         'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRomve4l-hfISJql72OHm_kUbuK2pcd-KIn65X961B2Fy-GWKXlpmAUCiA&s=10'),
        ('Овощное рагу с кабачками', 'В мультиварке',
         'Кабачки — 1 шт.\nЛук — 1 шт.\nБолгарский перец — 2 шт.\nМорковь — 1 шт.\nПомидоры — 2 шт.\nЧеснок — 1 зубчик\nСоль, перец, зелень — по вкусу',
         '1. Лук, чеснок и морковку очистите от кожуры. Болгарские перцы разрежьте пополам и удалите семена с сердцевиной.\n'
         '2. Лук нарежьте тонкими полукольцами или четверть кольцами. Перцы измельчите соломкой. Морковку можно натереть на тёрке с крупными зубками или нарезать тонкими брусочками.\n'
         '3. В чашу мультиварки влейте небольшое количество растительного или оливкового масла. Отправьте лук, перец и морковь к маслу. Установите режим «Жарка» и готовьте овощи. Обжаривайте, помешивая, около 10 минут.\n'
         '4. Помидоры нарежьте небольшими кубиками или дольками. Предварительно снимите по желанию с томатов кожуру. Кабачки измельчите небольшими фрагментами.\n'
         '5. Отправьте помидоры и кабачки в чашу мультиварки. Закройте крышку мультиварки, установите режим «Тушение» и оставьте таким образом до готовности.',
         '45 мин', 60, 180,
         'https://multipovarenok.ru/wp-content/uploads/2016/08/orskvm_-9218382.jpg'),

        ('Шарлотка с яблоками', 'В микроволновке',
         'Яйца — 4 шт.\nСахар — 200 г\nМука — 200 г\nЯблоки — 4–5 шт.\nРазрыхлитель — 1 ч. л.\nСоль — щепотка',
         '1. Взбить яйца с сахаром до пышной массы.\n'
         '2. Добавить муку, разрыхлитель, соль, аккуратно перемешать.\n'
         '3. Яблоки очистить, нарезать тонкими ломтиками.\n'
         '4. Форму смазать, выложить яблоки, залить тестом.\n'
         '5. Готовить в микроволновке на полной мощности 8 минут.',
         '8', 220, 173,
         'https://img.povar.ru/mobile/70/dc/23/51/sharlotka_v_mikrovolnovke-257320.JPG'),

        ('Шарлотка с яблоками', 'В аэрогриле',
         'Яйца — 4 шт.\nСахар — 200 г\nМука — 200 г\nЯблоки — 4–5 шт.\nРазрыхлитель — 1 ч. л.\nСоль — щепотка',
         '1. Взбить яйца с сахаром до пышной массы.\n'
         '2. Добавить муку, разрыхлитель, соль, аккуратно перемешать.\n'
         '3. Яблоки очистить, нарезать тонкими ломтиками.\n'
         '4. Форму смазать, выложить яблоки, залить тестом.\n'
         '5. Выпекать в аэрогриле при 170 °C 25 минут.',
         '25', 220, 173,
         'https://img.povar.ru/mobile/db/51/3e/3b/sharlotka_s_yablokami_v_aerogrile-861381.jpg'),

        ('Шарлотка с яблоками', 'В духовке',
         'Яйца — 4 шт.\nСахар — 200 г\nМука — 200 г\nЯблоки — 4–5 шт.\nРазрыхлитель — 1 ч. л.\nСоль — щепотка',
         '1. Взбить яйца с сахаром до пышной массы.\n'
         '2. Добавить муку, разрыхлитель, соль, аккуратно перемешать.\n'
         '3. Яблоки очистить, нарезать тонкими ломтиками.\n'
         '4. Форму смазать, выложить яблоки, залить тестом.\n'
         '5. Выпекать в духовке при 180 °C 40 минут.',
         '40', 220, 173,
         'https://u-dostavka.ru/wp-content/uploads/2026/01/chatgp5555t-image-19-yanv.-2026-g.-18_45_21.png'),

        ('Банановый пирог', 'В микроволновке',
         'Бананы — 3 шт.\nЯйца — 2 шт.\nСахар — 150 г\nМука — 200 г\nРастительное масло — 100 мл\nСода — 1 ч. л.\nСоль — щепотка',
         '1. Бананы размять в пюре.\n'
         '2. Добавить яйца, сахар, масло, перемешать.\n'
         '3. Всыпать муку с содой и солью, замесить тесто.\n'
         '4. Вылить в форму.\n'
         '5. Готовить в микроволновке 9 минут на полной мощности.',
         '9', 280, 120,
         'https://www.photorecept.ru/wp-content/uploads/2021/11/bananovyj-keks-v-kruzhke-1-rotated.jpg'),

        ('Банановый пирог', 'В аэрогриле',
         'Бананы — 3 шт.\nЯйца — 2 шт.\nСахар — 150 г\nМука — 200 г\nРастительное масло — 100 мл\nСода — 1 ч. л.\nСоль — щепотка',
         '1. Бананы размять в пюре.\n'
         '2. Добавить яйца, сахар, масло, перемешать.\n'
         '3. Всыпать муку с содой и солью, замесить тесто.\n'
         '4. Вылить в форму.\n'
         '5. Выпекать в аэрогриле при 170 °C 35 минут.',
         '35', 280, 120,
         'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQUn3ghwZJkAi-qIDWQBtCUcsjRDbJm-iX7b1L_vXeSapRt4pGnorTVVEQ&s=10'),

        ('Банановый пирог', 'В духовке',
         'Бананы — 3 шт.\nЯйца — 2 шт.\nСахар — 150 г\nМука — 200 г\nРастительное масло — 100 мл\nСода — 1 ч. л.\nСоль — щепотка',
         '1. Бананы размять в пюре.\n'
         '2. Добавить яйца, сахар, масло, перемешать.\n'
         '3. Всыпать муку с содой и солью, замесить тесто.\n'
         '4. Вылить в форму.\n'
         '5. Выпекать в духовке при 180 °C 45 минут.',
         '45', 280, 120,
        'https://cdn.lifehacker.ru/wp-content/uploads/2020/02/shutterstock_1626998191_1581503885-e1583912298484-scaled-320x480.jpg' ),

        ('Сырники (десерт)', 'В микроволновке',
         'Творог — 500 г\nЯйцо — 1 шт.\nМука — 3–4 ст. л.\nСахар — 2 ст. л.\nСоль — щепотка\nВанилин — по вкусу',
         '1. Творог растереть с яйцом, сахаром, солью.\n'
         '2. Добавить муку, замесить мягкое тесто.\n'
         '3. Сформировать шайбочки, обвалять в муке.\n'
         '4. Готовить в микроволновке 5 минут на полной мощности.',
         '5', 220, 196,
         'https://img.povar.ru/mobile/dc/1c/1d/f1/sirniki_s_mankoi-310018.JPG'),

        ('Сырники (десерт)', 'В аэрогриле',
         'Творог — 500 г\nЯйцо — 1 шт.\nМука — 3–4 ст. л.\nСахар — 2 ст. л.\nСоль — щепотка\nВанилин — по вкусу',
         '1. Творог растереть с яйцом, сахаром, солью.\n'
         '2. Добавить муку, замесить мягкое тесто.\n'
         '3. Сформировать шайбочки, обвалять в муке.\n'
         '4. Выпекать в аэрогриле при 180 °C 20 минут.',
         '20', 220, 196,
         'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTB3NF_h1acN7gtOwLry6U2HJudnIKumGDbkb2lhAgj28hbM7Lm66Cpgf2r&s=10'),

        ('Сырники (десерт)', 'В духовке',
         'Творог — 500 г\nЯйцо — 1 шт.\nМука — 3–4 ст. л.\nСахар — 2 ст. л.\nСоль — щепотка\nВанилин — по вкусу',
         '1. Творог растереть с яйцом, сахаром, солью.\n'
         '2. Добавить муку, замесить мягкое тесто.\n'
         '3. Сформировать шайбочки, обвалять в муке.\n'
         '4. Выпекать в духовке при 180 °C 25 минут.',
         '25', 220, 196,
         'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSwrI1UQ7M1Db_NcO_ODfcvo_v3g1z31Q5Z0hFGtnMohDgBSzWZIamQvKL5&s=10'),


        ('Грушевый рулет', 'В микроволновке',
         'Груши — 3 шт.\nМука — 250 г\nЯйца — 2 шт.\nСахар — 120 г\nМасло сливочное — 100 г\nРазрыхлитель — 1 ч. л.\nКорица — по вкусу',
         '1. Масло растереть с сахаром, добавить яйца.\n'
         '2. Всыпать муку с разрыхлителем, замесить тесто.\n'
         '3. Груши нарезать тонко.\n'
         '4. Тесто раскатать, выложить груши, свернуть рулетом.\n'
         '5. Готовить в микроволновке 8 минут на полной мощности.',
         '8', 250, 300,
         'https://img.iamcook.ru/2026/upl/recipes/cat/u159678-efbc21983625b80a65b574ca29017039.JPG'),

        ('Грушевый рулет', 'В аэрогриле',
         'Груши — 3 шт.\nМука — 250 г\nЯйца — 2 шт.\nСахар — 120 г\nМасло сливочное — 100 г\nРазрыхлитель — 1 ч. л.\nКорица — по вкусу',
         '1. Масло растереть с сахаром, добавить яйца.\n'
         '2. Всыпать муку с разрыхлителем, замесить тесто.\n'
         '3. Груши нарезать тонко.\n'
         '4. Тесто раскатать, выложить груши, свернуть рулетом.\n'
         '5. Выпекать в аэрогриле при 170 °C 30 минут.',
         '30', 250, 300,
         'https://i.ytimg.com/vi/4ITb0vtFLgw/maxresdefault.jpg'),

        ('Грушевый рулет', 'В духовке',
         'Груши — 3 шт.\nМука — 250 г\nЯйца — 2 шт.\nСахар — 120 г\nМасло сливочное — 100 г\nРазрыхлитель — 1 ч. л.\nКорица — по вкусу',
         '1. Масло растереть с сахаром, добавить яйца.\n'
         '2. Всыпать муку с разрыхлителем, замесить тесто.\n'
         '3. Груши нарезать тонко.\n'
         '4. Тесто раскатать, выложить груши, свернуть рулетом.\n'
         '5. Выпекать в духовке при 180 °C 35 минут.',
         '35', 250, 300,
         'https://img.iamcook.ru/2026/upl/recipes/byusers/misc/159678/910cb43379dd3c6db2a4c601b07f6bc4-2026.jpg'),


        ('Шоколадные кексы', 'В микроволновке',
         'Мука — 200 г\nКакао — 3 ст. л.\nСахар — 150 г\nЯйца — 2 шт.\nМолоко — 100 мл\nМасло растительное — 80 мл\nРазрыхлитель — 1 ч. л.',
         '1. Смешать сухие ингредиенты.\n'
         '2. Добавить яйца, молоко, масло, перемешать.\n'
         '3. Разлить по формочкам.\n'
         '4. Готовить в микроволновке 4 минуты на полной мощности.',
         '4', 320, 150,
         'https://www.russianfood.com/dycontent/images_upl/329/big_328965.jpg'),

        ('Шоколадные кексы', 'В аэрогриле',
         'Мука — 200 г\nКакао — 3 ст. л.\nСахар — 150 г\nЯйца — 2 шт.\nМолоко — 100 мл\nМасло растительное — 80 мл\nРазрыхлитель — 1 ч. л.',
         '1. Смешать сухие ингредиенты.\n'
         '2. Добавить яйца, молоко, масло, перемешать.\n'
         '3. Разлить по формочкам.\n'
         '4. Выпекать в аэрогриле при 170 °C 18 минут.',
         '18', 320, 150,
         'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRiPjr1EcagNoq6szoHhqxSMfcUzN22TkyN56G639NAqm1yl1qZ-GZPs-2X&s=10'),

        ('Шоколадные кексы', 'В духовке',
         'Мука — 200 г\nКакао — 3 ст. л.\nСахар — 150 г\nЯйца — 2 шт.\nМолоко — 100 мл\nМасло растительное — 80 мл\nРазрыхлитель — 1 ч. л.',
         '1. Смешать сухие ингредиенты.\n'
         '2. Добавить яйца, молоко, масло, перемешать.\n'
         '3. Разлить по формочкам.\n'
         '4. Выпекать в духовке при 180 °C 25 минут.',
         '25', 320, 150,
        'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTxsUH16Bv6fL39YrJLzyFcH9jj2RC5ngHOcyut0wz9Iu8gHe080QsEO1rS&s=10'),


        ('Оладьи яблочные', 'В микроволновке',
         'Яблоки — 2 шт.\nМука — 150 г\nКефир — 200 мл\nЯйцо — 1 шт.\nСахар — 2 ст. л.\nСода — ½ ч. л.',
         '1. Яблоки натереть на тёрке.\n'
         '2. Смешать кефир, яйцо, сахар, соду.\n'
         '3. Добавить муку и яблоки, перемешать.\n'
         '4. Готовить в микроволновке 5 минут на полной мощности.',
         '5', 180, 200,
         'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRgd6q9-Q4Ypz0hw489RQYp_pH9zp46wDGpTAyHD4oqVCGDVj39x4KjDHM&s=10'),

        ('Оладьи яблочные', 'В аэрогриле',
         'Яблоки — 2 шт.\nМука — 150 г\nКефир — 200 мл\nЯйцо — 1 шт.\nСахар — 2 ст. л.\nСода — ½ ч. л.',
         '1. Яблоки натереть на тёрке.\n'
         '2. Смешать кефир, яйцо, сахар, соду.\n'
         '3. Добавить муку и яблоки, перемешать.\n'
         '4. Выпекать в аэрогриле при 170 °C 15 минут.',
         '15', 180, 200,
         'https://cdn.lifehacker.ru/wp-content/uploads/2026/09/yablochnye_oladi_1_1790603510.jpg'),

        ('Оладьи яблочные', 'В духовке',
         'Яблоки — 2 шт.\nМука — 150 г\nКефир — 200 мл\nЯйцо — 1 шт.\nСахар — 2 ст. л.\nСода — ½ ч. л.',
         '1. Яблоки натереть на тёрке.\n'
         '2. Смешать кефир, яйцо, сахар, соду.\n'
         '3. Добавить муку и яблоки, перемешать.\n'
         '4. Выпекать в духовке при 180 °C 20 минут.',
         '20', 180, 200,
         'https://www.russianfood.com/dycontent/images_upl/304/big_303559.jpg'),


        ('Вишнёвый пирог', 'В микроволновке',
         'Вишня — 400 г (без косточек)\nМука — 250 г\nЯйца — 3 шт.\nСахар — 180 г\nМасло сливочное — 100 г\nРазрыхлитель — 1 ч. л.',
         '1. Масло растереть с сахаром, добавить яйца.\n'
         '2. Всыпать муку с разрыхлителем.\n'
         '3. Выложить вишню, залить тестом.\n'
         '4. Готовить в микроволновке 10 минут на полной мощности.',
         '10', 240, 340,
         'https://www.yournutrition.ru/images/recipes/3681/photo510.jpg'),

        ('Вишнёвый пирог', 'В аэрогриле',
         'Вишня — 400 г (без косточек)\nМука — 250 г\nЯйца — 3 шт.\nСахар — 180 г\nМасло сливочное — 100 г\nРазрыхлитель — 1 ч. л.',
         '1. Масло растереть с сахаром, добавить яйца.\n'
         '2. Всыпать муку с разрыхлителем.\n'
         '3. Выложить вишню, залить тестом.\n'
         '4. Выпекать в аэрогриле при 170 °C 35 минут.',
         '35', 240, 340,
         'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS39hBc23A4Nq1JWAlxqeVXWd64JjRuiIXSoKsb2gJ29WkTEd6bgbjom8k&s=10'),

        ('Вишнёвый пирог', 'В духовке',
         'Вишня — 400 г (без косточек)\nМука — 250 г\nЯйца — 3 шт.\nСахар — 180 г\nМасло сливочное — 100 г\nРазрыхлитель — 1 ч. л.',
         '1. Масло растереть с сахаром, добавить яйца.\n'
         '2. Всыпать муку с разрыхлителем.\n'
         '3. Выложить вишню, залить тестом.\n'
         '4. Выпекать в духовке при 180 °C 45 минут.',
         '45', 240, 340,
         'https://baking-academy.ru/upload/recipes/c7d/c7d77908cb44439fcb93cf7942c68662.jpg'),

                ('Печенье брауни', 'В микроволновке',
         'Шоколад тёмный — 200 г\nМасло сливочное — 100 г\nСахар — 150 г\nЯйца — 2 шт.\nМука — 100 г\nКакао — 2 ст. л.',
         '1. Шоколад растопить с маслом.\n'
         '2. Добавить сахар, яйца, перемешать.\n'
         '3. Всыпать муку и какао.\n'
         '4. Выложить ложкой на противень.\n'
         '5. Готовить в микроволновке 3 минуты на полной мощности.',
         '3', 400, 350,
         'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ8sAVdMIN08-rDlUA7XS-0jIXjAxcLUdva1MuzhoeETPN3qPL-Yt-dtnc&s=10'),

        ('Печенье брауни', 'В аэрогриле',
         'Шоколад тёмный — 200 г\nМасло сливочное — 100 г\nСахар — 150 г\nЯйца — 2 шт.\nМука — 100 г\nКакао — 2 ст. л.',
         '1. Шоколад растопить с маслом.\n'
         '2. Добавить сахар, яйца, перемешать.\n'
         '3. Всыпать муку и какао.\n'
         '4. Выложить ложкой на противень.\n'
         '5. Выпекать в аэрогриле при 170 °C 12 минут.',
         '12', 400, 350,
        'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTn9NeV7E1z-0W2TZLj5rWO72dT6WxGCp5UUKtJQ7EC0ASW3Jah-X50hP2P&s=10'),

        ('Печенье брауни', 'В духовке',
         'Шоколад тёмный — 200 г\nМасло сливочное — 100 г\nСахар — 150 г\nЯйца — 2 шт.\nМука — 100 г\nКакао — 2 ст. л.',
         '1. Шоколад растопить с маслом.\n'
         '2. Добавить сахар, яйца, перемешать.\n'
         '3. Всыпать муку и какао.\n'
         '4. Выложить ложкой на противень.\n'
         '5. Выпекать в духовке при 180 °C 15 минут.',
         '15', 400, 350,
         'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRYZQl9gTOJeysvtK-sg3n8bKn0FkBB1RUSkBL2unmtU38peBSYvGfOtAGr&s=10'),

    ]

    insert_dishes(conn, dishes)
    insert_recipes(conn, recipes)

    conn.commit()
    conn.close()
   


if __name__ == '__main__':
    main()
